{
   "_meta":{
      "sources":[
         {
            "json":"JS",
            "abbreviation":"JS",
            "full":"Jay Sun",
            "authors":[
               "Jay Sun"
            ],
            "color":"ff4500",
            "convertedBy":[
               "BluMasc"
            ],
            "version":"1.0",
            "url":"https://homebrewery.naturalcrit.com/share/TON1C0_g",
            "targetSchema":"1.6.3"
         }
      ],
      "dependencies":{
         "monster":[
            "MM"
         ]
      }
   },
   "variant":[
      
   ],
   "item":[
      
   ],
   "disease":[
      
   ],
   "monster":[
      
   ],
   "feat":[
      {
         "name":"Black Bless",
         "source":"JS",
         "entries":[
            "You amass bad luck around you, as you harvest it from the misfortune of others to tip the scales in your favour.",
            "You have 1 misfortune point. You can spend 1 misfortune point to replace any attack roll, saving throw, or ability check made by you or a creature that you can see with a 1. You must choose to do so before the roll, and you can replace a roll in this way only once per turn.",
            "When a creature you can see rolls a 1, you gain an additional misfortune point up to a maximum of 3.",
            "If you have 3 misfortune points, you can spend all of them in the same fashion to replace one roll with a 20.",
            "If multiple creatures use misfortune points on the same roll, they cancel out, resulting in no changes to the roll.",
            "When you finish a long rest and have no misfortune points, you regain 1."
         ]
      }
   ],
   "spell":[
      {
         "name":"Yama's Pocket",
         "source":"JS",
         "page":0,
         "level":2,
         "classes":{
            "fromClassList":[
               {
                  "name":"Wizard",
                  "source":"PHB"
               },
               {
                  "name":"Artificer",
                  "source":"TCE"
               }
            ]
         },
         "school":"C",
         "time":[
            {
               "number":1,
               "unit":"action"
            }
         ],
         "range":{
            "type":"point",
            "distance":{
               "type":"touch"
            }
         },
         "components":{
            "v":true,
            "s":true
         },
         "duration":[
            {
               "type":"timed",
               "duration":{
                  "type":"minute",
                  "amount":10
               },
               "concentration":true
            }
         ],
         "meta":{
            "ritual":true
         },
         "entries":[
            "You place a silver thread on a solid surface. The thread formes a circle and opens an entrance to an extradimensional space, individual to each caster. You can reach into the extradimensional space, but no creature can remain in it, when you stop concentrating on the spell. All objects you place inside will remain there, even after you stopped concentrating on the spell and can be accessed the next time you cast the spell. The extradimensional space can hold no more than 2500 lb. and retrieving an item requires at least an action.",
            "Using aditional silver thread for the spell, 50 gp worth for each 5 feet square, you can open an entrance as big as a 10 feet square (200 gp)."
         ]
      },
      {
         "name":"Sparagmos",
         "source":"JS",
         "page":0,
         "level":4,
         "classes":{
            "fromClassList":[
               {
                  "name":"Warlock",
                  "source":"PHB"
               }
            ]
         },
         "school":"T",
         "time":[
            {
               "number":1,
               "unit":"action"
            }
         ],
         "range":{
            "type":"line",
            "distance":{
               "type":"feet",
               "amount":60
            }
         },
         "components":{
            "v":true,
            "s":true,
            "m":{
               "text":"an umbilical cord encased in onyx worth at least 150 gp",
               "cost":15000
            }
         },
         "duration":[
            {
               "type":"timed",
               "duration":{
                  "type":"minute",
                  "amount":1
               },
               "concentration":true
            }
         ],
         "entries":[
            "A blade of stagnant light flashes out from your hand in a 5-foot-wide, 60-foot-long line. Each creature in the line must make a Dexterity saving throw. On a failed save, a creature takes {@damage 4d8 + 10} force damage. On a successful save, it takes half as much damage. If this damage reduces the target to 0 hit points, it is disintegrated. A disintegrated creature and everything it is wearing and carrying, except magic items, are reduced to a pile of fine gray dust. The creature can be restored to life only by means of a true resurrection or a wish spell.",
            "You can create a new blade of light as your action on any turn until the spell ends.",
            "For the duration, a darting flame of stagnant light shines in your hand. It sheds dim light in a 15-foot radius.",
            "When you cast this spell using a spell slot of 5th level or higher, the damage increases by {@dice 1d8} for each slot level above 4th."
         ],
         "damageInflict":[
            "force"
         ],
         "savingThrow":[
            "dexterity"
         ],
         "miscTags":[
            "HL"
         ]
      },
      {
         "name":"Paladin's Sacrifice",
         "source":"JS",
         "page":0,
         "level":2,
         "classes":{
            "fromClassList":[
               {
                  "name":"Paladin",
                  "source":"PHB"
               }
            ]
         },
         "school":"A",
         "time":[
            {
               "number":1,
               "unit":"reaction"
            }
         ],
         "range":{
            "type":"point",
            "distance":{
               "type":"feet",
               "amount":30
            }
         },
         "components":{
            "v":true,
            "s":true
         },
         "duration":[
            {
               "type":"instant"
            }
         ],
         "entries":[
            "You open up a brief but powerful devine conduit between you and another creature, taking on the damage and any other effects that creature suffers. When a creature in range is hit by an attack or fails a saving throw, you can cast this spell as a reaction and the wound and/or effects are magically transmitted to you instead of the target. You are affected as if you were hit by the attack or failed the saving throw, taking all the damage and suffering all of the adverse effects. Any resistance or immunity you have are applied normally, but you cannot otherwise reduce or negate the damage of effects in that way.",
            "If you use this spell against an effect that also targets you or includes you in its area, you suffer the effects for both yourself and the target you spared, potentially taking damage or suffering other consequences twice."
         ]
      },
      {
         "name":"Hail of Blades",
         "source":"JS",
         "page":0,
         "level":5,
         "classes":{
            "fromClassList":[
               {
                  "name":"Wizard",
                  "source":"PHB"
               },
               {
                  "name":"Paladin",
                  "source":"PHB"
               }
            ]
         },
         "school":"C",
         "time":[
            {
               "number":1,
               "unit":"action"
            }
         ],
         "range":{
            "type":"point",
            "distance":{
               "type":"feet",
               "amount":90
            }
         },
         "components":{
            "v":true,
            "s":true
         },
         "duration":[
            {
               "type":"timed",
               "duration":{
                  "type":"minute",
                  "amount":1
               },
               "concentration":true
            }
         ],
         "entries":[
            "The area in a 20-foot-radius, 60-foot-high cylinder centered on a point within range is showered in a hail of conjured blades that fall from the sky. Each creature within the area must make a Dexterity saving throw once. A creature takes {@damage 5d8} slashing damage on a failed save, or half as much damage on a successful one. The ground in the cylinder's space becomes difficult terrain for the spells duration.",
            "Until the spell ends, you can use your bonus action on each of your turns to hurl a random blade sticking out of the ground from the cylinder at one creature you can see within 40 feet of the cylinder. Make a ranged spell attack. On a hit, the target takes {@damage 2d6} slashing damage. A melee attack made with one of the blades created by this spell use the longsword statistics but deal {@dice 2d6} magical slashing damage and attacks made with them have disadvantage against you. All blades conjured by this spell dissapear after they delt damage or when the spell ends."
         ],
         "entriesHigherLevel":[
            {
               "type":"entries",
               "name":"At Higher Levels",
               "entries":[
                  "When you cast this spell using a spell slot of 6th level or higher, the slashing damage of the first part of the spell increases by {@dice 1d8} for each slot level above 5th."
               ]
            }
         ],
         "damageInflict":[
            "slashing"
         ],
         "spellAttack":[
            "R"
         ],
         "savingThrow":[
            "dexterity"
         ],
         "miscTags":[
            "SGT"
         ]
      },
      {
         "name":"Grasp of Levistus",
         "source":"JS",
         "page":0,
         "level":2,
         "classes":{
            "fromClassList":[
               {
                  "name":"Bard",
                  "source":"PHB"
               },
               {
                  "name":"Sorcerer",
                  "source":"PHB"
               },
               {
                  "name":"Warlock",
                  "source":"PHB"
               },
               {
                  "name":"Wizard",
                  "source":"PHB"
               },
               {
                  "name":"Artificer",
                  "source":"TCE"
               }
            ]
         },
         "school":"V",
         "time":[
            {
               "number":1,
               "unit":"action"
            }
         ],
         "range":{
            "type":"point",
            "distance":{
               "type":"feet",
               "amount":90
            }
         },
         "components":{
            "v":true
         },
         "duration":[
            {
               "type":"timed",
               "duration":{
                  "type":"minute",
                  "amount":1
               },
               "concentration":true
            }
         ],
         "entries":[
            "A thick nail of opaque and dark ice appears sticking out of one creature you can see within range. The target must make a Constitution saving throw. It takes {@damage 3d8} cold damage on a failed save, or half as much damage on a successful one. On a failed save, the target also beginns freezing over for the spell's duration. The impaled targets experiences the pain as if burning alive.",
            "At the end of each of its turns, the target repeats the saving throw. It takes {@damage 2d6} fire damage on a failed save, and the spell ends on a successful one. Immunity or resistance to fire damage can't reduce the fire damage taken in this way.",
            "If damage from this spell kills a target, the target is encased into a thick block of ice. This magical ice can't be destroyed by nonmagical means."
         ],
         "damageResist":[
            "fire"
         ],
         "damageImmune":[
            "fire"
         ],
         "damageVulnerable":[
            "fire"
         ],
         "damageInflict":[
            "cold",
            "fire"
         ],
         "savingThrow":[
            "constitution"
         ],
         "miscTags":[
            "SGT"
         ]
      },
      {
         "name":"Glacial Path",
         "source":"JS",
         "page":0,
         "level":3,
         "school":"C",
         "classes":{
            "fromClassList":[
               {
                  "name":"Sorcerer",
                  "source":"PHB"
               },
               {
                  "name":"Wizard",
                  "source":"PHB"
               },
               {
                  "name":"Artificer",
                  "source":"TCE"
               }
            ]
         },
         "time":[
            {
               "number":1,
               "unit":"action"
            }
         ],
         "range":{
            "type":"point",
            "distance":{
               "type":"feet",
               "amount":120
            }
         },
         "components":{
            "v":true,
            "s":true,
            "m":"a white dragon's scale, a shard of ice"
         },
         "duration":[
            {
               "type":"timed",
               "duration":{
                  "type":"minute",
                  "amount":1
               },
               "concentration":true
            }
         ],
         "entries":[
            "You conjure up a cloud of freezing air in the shape of a creature that travels down on an area within range, coating the ground and all objects in the area with a layer of ice. The area can be up to 30 feet long and up to 10 feet wide. Each creature in that area must make a Constitution saving throw. A creature takes {@damage 4d8} cold damage on a failed save, or half as much damage on a successful one. The area becomes difficult terrain for the duration and any creature that starts its turn in the area takes {@damage 2d6} cold damage.",
            "When you cast this spell using a spell slot of 4 th level or higher, the initial damage increases by {@dice 1d8} for each slot level above 3rd."
         ],
         "damageInflict":[
            "cold"
         ],
         "savingThrow":[
            "constitution"
         ]
      },
      {
         "name":"Forked Lightning",
         "source":"JS",
         "page":0,
         "level":3,
         "school":"V",
         "classes":{
            "fromClassList":[
               {
                  "name":"Sorcerer",
                  "source":"PHB"
               },
               {
                  "name":"Wizard",
                  "source":"PHB"
               },
               {
                  "name":"Artificer",
                  "source":"TCE"
               }
            ]
         },
         "time":[
            {
               "number":1,
               "unit":"action"
            }
         ],
         "range":{
            "type":"point",
            "distance":{
               "type":"feet",
               "amount":90
            }
         },
         "duration":[
            {
               "type":"instant"
            }
         ],
         "components":{
            "v":true,
            "s":true,
            "m":"a bit of fur; a piece of amber, glass, or a crystal rod; and a forked silver tongue"
         },
         "entries":[
            "You point with your fingers at two targets in range, lightning arcs from your fingertips toward them. Make a ranged spell attack against each target. On a hit, the target takes {@damage 2d6} lightning damage. Hit or miss, the bolts then leap from the target to those within 5 feet of it. Each creature within 5 feet of the two targets must succeed on a Dexterity saving throw or take {@damage 3d6} lightning damage."
         ],
         "entriesHigherLevel":[
            {
               "type":"entries",
               "name":"At Higher Levels",
               "entries":[
                  "When you cast this spell using a spell slot of 4th level or higher, the lightning damage increases by {@dice 1d6} for both parts of the spell, for each slot level above 3rd."
               ]
            }
         ],
         "damageInflict":[
            "lightning"
         ],
         "spellAttack":[
            "R"
         ],
         "savingThrow":[
            "dexterity"
         ]
      },
      {
         "name":"Fiernas Brand",
         "source":"JS",
         "page":0,
         "level":2,
         "school":"E",
         "classes":{
            "fromClassList":[
               {
                  "name":"Bard",
                  "source":"PHB"
               },
               {
                  "name":"Sorcerer",
                  "source":"PHB"
               },
               {
                  "name":"Warlock",
                  "source":"PHB"
               }
            ]
         },
         "time":[
            {
               "number":1,
               "unit":"bonus"
            }
         ],
         "range":{
            "type":"point",
            "distance":{
               "type":"feet",
               "amount":90
            }
         },
         "components":{
            "v":true,
            "s":true,
            "m":"a dog-collar"
         },
         "duration":[
            {
               "type":"timed",
               "duration":{
                  "type":"minute",
                  "amount":1
               }
            }
         ],
         "entries":[
            "You place a searing brand around a creatures neck that you can see within range. Until the spell ends, every time the target takes fire damage, it takes an additional {@damage 1d4} fire damage. Also, if the target drops to 0 hit points as a result of taking fire damage before the spell ends, it errupts into flames, creating a devastating fire-explosion. All creatures within 20 feet of the target take {@damage 4d6} fire damage, or half damage with a successful Dexterity savong throw. The fire spreads around corners and ignites flammable objects in the area that aren't being worn or carried. The target is reduced to a lifeless pile of ash."
         ],
         "damageInflict":[
            "fire"
         ],
         "miscTags":[
            "SGT"
         ]
      },
      {
         "name":"Coin Toss",
         "source":"JS",
         "page":0,
         "level":0,
         "school":"T",
         "time":[
            {
               "number":1,
               "unit":"bonus"
            }
         ],
         "range":{
            "type":"point",
            "distance":{
               "type":"touch"
            }
         },
         "components":{
            "v":true,
            "s":true
         },
         "classes":{
            "fromClassList":[
               {
                  "name":"Bard",
                  "source":"PHB"
               },
               {
                  "name":"Sorcerer",
                  "source":"PHB"
               },
               {
                  "name":"Warlock",
                  "source":"PHB"
               },
               {
                  "name":"Wizard",
                  "source":"PHB"
               },
               {
                  "name":"Artificer",
                  "source":"TCE"
               }
            ]
         },
         "duration":[
            {
               "type":"timed",
               "duration":{
                  "type":"minute",
                  "amount":1
               }
            }
         ],
         "entries":[
            "You touch one to three coins and imbue them with the magic of currency for the duration. You or someone else can make a ranged spell attack with one of the coins by throwing it or hurling it with a sling. If thrown, it has a range of 60 feet. If someone else attacks with the coin, that attacker adds your spellcasting ability modifier, not the attacker's, to the attack roll. On a hit, the target takes bludgeoning damage as shown on the coin table below. Hit or miss, the spell then consumes the coin as payment, destroying it in the process.",
            "If you cast this spell again, the spell ends early on any coins still affected by it.",
            {
               "type":"table",
               "caption":"Coin Table",
               "colLabels":[
                  "Coin",
                  "Level 1-4",
                  "Level  5-10",
                  "Level 11-16",
                  "Level 17+"
               ],
               "colStyles":[
                  "text-align-left col-2 text-center",
                  "col-2 text-center",
                  "col-3 text-center",
                  "col-3 text-center",
                  "col-2 text-center"
               ],
               "rows":[
                  [
                     "Copper",
                     "{@dice 1d4}",
                     "{@dice 2d4}",
                     "{@dice 3d4}",
                     "{@dice 4d4}"
                  ],
                  [
                     "Silver",
                     "{@dice 1d6}",
                     "{@dice 2d6}",
                     "{@dice 3d6}",
                     "{@dice 4d6}"
                  ],
                  [
                     "Electrum",
                     "{@dice 1d8}",
                     "{@dice 2d8}",
                     "{@dice 3d8}",
                     "{@dice 4d8}"
                  ],
                  [
                     "Gold",
                     "{@dice 1d10}",
                     "{@dice 2d10}",
                     "{@dice 3d10}",
                     "{@dice 4d10}"
                  ],
                  [
                     "Platinum",
                     "{@dice 1d12}",
                     "{@dice 2d12}",
                     "{@dice 3d12}",
                     "{@dice 4d12}"
                  ]
               ]
            }
         ],
         "spellAttack":[
            "R"
         ]
      },
      {
         "name":"Chaos Surge",
         "source":"JS",
         "page":0,
         "level":4,
         "duration":[
            {
               "type":"instant"
            }
         ],
         "school":"V",
         "time":[
            {
               "number":1,
               "unit":"action"
            }
         ],
         "range":{
            "type":"radius",
            "distance":{
               "type":"feet",
               "amount":30
            }
         },
         "classes":{
            "fromClassList":[
               {
                  "name":"Sorcerer",
                  "source":"PHB"
               }
            ]
         },
         "components":{
            "v":true
         },
         "entries":[
            "You errupt in a crackling and boiling wave of highly chaotic energy. Each creature within 30 feet of you must succeed on a Dexterity saving throw or take {@damage 5d8} damage. A creature that succeeds on its saving throw takes half as much damage. Roll a {@dice d10} and add the number to the damage total. The number rolled on that die determines the attack's damage type, as shown below.",
            {
               "type":"table",
               "colLabels":[
                  "d10",
                  "Damage Type"
               ],
               "colStyles":[
                  "col-1 text-center",
                  "text-align-left col-11"
               ],
               "rows":[
                  [
                     "1",
                     "Acid"
                  ],
                  [
                     "2",
                     "Thunder"
                  ],
                  [
                     "3",
                     "Cold"
                  ],
                  [
                     "4",
                     "Necrotic"
                  ],
                  [
                     "5",
                     "Fire"
                  ],
                  [
                     "6",
                     "Force"
                  ],
                  [
                     "7",
                     "Radiant"
                  ],
                  [
                     "8",
                     "Lightning"
                  ],
                  [
                     "9",
                     "Poison"
                  ],
                  [
                     "10",
                     "Psychic"
                  ]
               ]
            },
            "After the damage is dealt, the wave returns to you. Roll a {@dice d6}, the number rolled on that die determines the outcome the backlash of the chaotic energy has, as shown below.",
            {
               "type":"table",
               "colLabels":[
                  "d6",
                  "Backlash Effect"
               ],
               "colStyles":[
                  "col-1 text-center",
                  "text-align-left col-11"
               ],
               "rows":[
                  [
                     "1",
                     "You drop to 1 hit point. A beholder controlled by the DM appears in an unoccupied spaces within 60 feet of you. Its total hit points are the hit points you lost due to this effect. It vanishes after 1 minute. Statistics for the beholder are in the *Monster Manual*."
                  ],
                  [
                     "2",
                     "You cast *scatter* on yourself and up to five creatures within 30 feet."
                  ],
                  [
                     "3",
                     "You cast *summon greater demon* without the need of material components."
                  ],
                  [
                     "4",
                     "A zombie bursts out of every creature killed by this damage. The zombie pursues whatever creature it can see that is closest to it. Statistics for the zombie are in the *Monster Manual*."
                  ],
                  [
                     "5",
                     "You turn into an air, earth, fire or water elemental of the DMs choice for one minute. Use the rulses for the *wild shape* feature. Statistics for these elementals are in the *Monster Manual*."
                  ],
                  [
                     "6",
                     "You cast *chaotic surge* again without expending a spell slot."
                  ]
               ]
            },
            "When you cast this spell using a spell slot of 5th level or higher, each target takes l{@damage d8} extra damage of the type rolled for each slot level above 4th."
         ],
         "savingThrow":[
            "dexterity"
         ]
      }
   ],
   "subclass":[
      {
         "name":"Arcane Weaving",
         "shortName":"Weaving",
         "source":"JS",
         "subclassFeatures":[
            "Arcane Weaving|Wizard||Weaving|JS|2",
            "Leyline Rune|Wizard||Weaving|JS|2",
            "Rule of Three|Wizard||Weaving|JS|6",
            "Forceful Magic|Wizard||Weaving|JS|10",
            "Knot and Tear|Wizard||Weaving|JS|14"
         ],
         "className":"Wizard",
         "classSource":"PHB"
      },
      {
         "name":"Way of the Fractured Shifter",
         "source":"JS",
         "className":"Monk",
         "classSource":"PHB",
         "shortName":"Fractured Shifter",
         "subclassFeatures":[
            "Way of the Fractured Shifter|Monk||Fractured Shifter|JS|3",
            "Sway of the Mist|Monk||Fractured Shifter|JS|6",
            "Phasing Strike|Monk||Fractured Shifter|JS|6",
            "Open the Border|Monk||Fractured Shifter|JS|11",
            "Phantom Soul|Monk||Fractured Shifter|JS|17"
         ]
      },
      {
         "name":"The Parasite",
         "shortName":"Parasite",
         "source":"JS",
         "subclassSpells":[
            {
               "name":"entangle",
               "source":"PHB"
            },
            {
               "name":"inflict wounds",
               "source":"PHB"
            },
            {
               "name":"alter self",
               "source":"PHB"
            },
            {
               "name":"spike growth",
               "source":"PHB"
            },
            {
               "name":"haste",
               "source":"PHB"
            },
            {
               "name":"stinking cloud",
               "source":"PHB"
            },
            {
               "name":"blight",
               "source":"PHB"
            },
            {
               "name":"greater invisibility",
               "source":"PHB"
            },
            {
               "name":"bigby's hand",
               "source":"PHB"
            },
            {
               "name":"destructive wave",
               "source":"PHB"
            }
         ],
         "additionalSpells":[
            {
               "expanded":{
                  "1":[
                     "entangle",
                     "inflict wounds"
                  ]
               }
            },
            {
               "expanded":{
                  "2":[
                     "alter self",
                     "spike growth"
                  ]
               }
            },
            {
               "expanded":{
                  "3":[
                     "haste",
                     "stinking cloud"
                  ]
               }
            },
            {
               "expanded":{
                  "4":[
                     "blight",
                     "greater invisibility"
                  ]
               }
            },
            {
               "expanded":{
                  "5":[
                     "bigby's hand",
                     "destructive wave"
                  ]
               }
            }
         ],
         "subclassFeatures":[
            "The Parasite|Warlock||Parasite|JS|1",
            "Extra Attack|Warlock||Parasite|JS|6",
            "Parasite Adaptation|Warlock||Parasite|JS|6",
            "Parasite Segmentation|Warlock||Parasite|JS|10",
            "Parasite Assimilation|Warlock||Parasite|JS|14"
         ],
         "className":"Warlock",
         "classSource":"PHB"
      }
   ],
   "subclassFeature":[
      {
         "name":"Arcane Weaving",
         "source":"JS",
         "className":"Wizard",
         "classSource":"PHB",
         "subclassShortName":"Weaving",
         "subclassSource":"JS",
         "level":2,
         "entries":[
            "The tradition of Arcane Weaving came into existence as a byproduct when students of War Magic tried to find new advantageous methods to boost their magic. They found ways to manipulate the Weave around them by drawing magical runes onto the ground. This method however clashed with their other practices and was frowned upon by teachers.",
            "Followers of this tradition are known as arcane weavers. Their magic has the best effects on simple to use spells. Their primary spell became magic missile, as it was deemed the most reliable spell for this practice. Arcane weavers rely on using Leyline Runes which open up the Weave to further manipulation. This makes it possible to simultaneously cast empowered spells while standing on these runes as well as preparing and empowering a magic missile spell. Placing their runes in advantageous places on the battlefield became mandatory to not be caught out of position.",
            "Although arcane weavers often get called hacks for their practices by other wizards, because they found ways to cheat out spells unlike other traditions, their understanding of the Weave and its manipulation is what solidified their place among the others. ",
            {
               "type":"refSubclassFeature",
               "subclassFeature":"Bonus Spell|Wizard||Weaving|JS|2"
            }
         ]
      },
      {
         "name":"Bonus Spell",
         "source":"JS",
         "className":"Wizard",
         "classSource":"PHB",
         "subclassShortName":"Weaving",
         "subclassSource":"JS",
         "level":2,
         "entries":[
            "Beginning when you select this tradition at 2nd level, you add the {@spell magic missile} spell to your spellbook if it is not there already. If this spell is already in your spellbook, you add one cantrip of your choice from the wizard spell list instead. "
         ]
      },
      {
         "name":"Leyline Rune",
         "source":"JS",
         "className":"Wizard",
         "classSource":"PHB",
         "subclassShortName":"Weaving",
         "subclassSource":"JS",
         "level":2,
         "entries":[
            "At 2nd level, you have learned to draw runes on the ground that let you manipulate magic in various ways. You can place a leyline rune on the ground underneath you in a 5 feet square as a bonus action, which lasts for 1 minute and does not disappear if you leave the space of the rune or if you place a new one. ",
            "While standing on a leyline rune you gain the following benefits:",
            {
               "type":"list",
               "items":[
                  "Casting a spell of 1st level or higher will add 1 dart to your next magic missile spell, up to a maximum equal Intelligence modifier (minimum of 1). These darts will hover above you until you cast {@spell magic missile} or until you finish a long rest.",
                  "When you deal damage with a cantrip you gain a bonus to damage rolls equal to your proficiency bonus. ",
                  "You gain a +2 bonus to Constitution saving throws to maintain your concentration on spells."
               ]
            },
            "Once you have placed leyline runes up to a number of times equal to your proficiency bonus, you must finish a short or long rest before you can place leyline runes again.",
            "Casting a spell of 5th level or higher will always create a leyline rune underneath you."
         ]
      },
      {
         "name":"Rule of Three",
         "source":"JS",
         "className":"Wizard",
         "classSource":"PHB",
         "subclassShortName":"Weaving",
         "subclassSource":"JS",
         "level":6,
         "entries":[
            "Starting at 6th level, you learn to extract the traces of your spells and store them even when you are not standing on your leyline rune. After expending 3 spellslots to cast spells of 1st level or higher, you can cast magic missile at 1st level without spending a spellslot. ",
            "These traces appear as small arcane beads that circle around you until you finish a long rest. Once you have gathered 3 of them, they will transform into darts that hover above you until you cast magic missile or until you finish a long rest."
         ]
      },
      {
         "name":"Forceful Magic",
         "source":"JS",
         "className":"Wizard",
         "classSource":"PHB",
         "subclassShortName":"Weaving",
         "subclassSource":"JS",
         "level":10,
         "entries":[
            "At 10th level, you learn how to cast spells in a more forceful and rawer way. When you cast a spell that deals damage while standing on your leyline rune, you can substitute the damage it deals with force damage. "
         ]
      },
      {
         "name":"Knot and Tear",
         "source":"JS",
         "className":"Wizard",
         "classSource":"PHB",
         "subclassShortName":"Weaving",
         "subclassSource":"JS",
         "level":14,
         "entries":[
            "Beginning at 14th level, your spells rip violent gashes into the weave or knot it. When you cast a spell that affects a creature, you can cause the weave around them to tear or to knot.",
            {
               "type":"list",
               "items":[
                  {
                     "type":"entries",
                     "name":"Knot.",
                     "entries":[
                        "When a creature is affected by one of your spells that would deal damage, it takes no damage instead. When you tighten the weave around a creature while standing on your leyline rune, they have resistance on saving throws against spells until the start of your next turn or until you stop concentrating on the spell."
                     ]
                  },
                  {
                     "type":"entries",
                     "name":"Tear.",
                     "entries":[
                        "When you hit a creature with a spell of first level or higher, or when it fails its saving throw it takes 2d12 force damage, no more than once per spell per creature. While standing on your leyline rune, your cantrips can tear the weave as well."
                     ]
                  }
               ]
            }
         ]
      },
      {
         "name":"The Parasite",
         "source":"JS",
         "page":0,
         "className":"Warlock",
         "classSource":"PHB",
         "subclassShortName":"Parasite",
         "subclassSource":"JS",
         "level":1,
         "entries":[
            "Your patron fused with your body. It is an alien creature, unknown and incomprehensible to most mortals. The parasite wants to survive and you are its means to do so. Not even your thoughts might be safe anymore as it knows everything you do. It could become a strong ally or a very eerie enemy. This alien might be older than you expect and might know more about the universe than you can imagine. Getting rid of it seems nigh impossible but blindly following it could be your end too.",
            "This patron can only survive within a host and it will equip you with the necessary abilities to ensure your survival. It will form a strong bond with you, if you like it or not.",
            {
               "name":"Expanded Spell List",
               "page":0,
               "entries":[
                  "The Parasite lets you choose from an expanded list of spells when you learn a warlock spell. The following spells are added to the warlock spell list for you.",
                  {
                     "type":"table",
                     "caption":"Parasite Expanded Spells",
                     "colLabels":[
                        "Spell Level",
                        "Spells"
                     ],
                     "colStyles":[
                        "col-3 text-center",
                        "col-9"
                     ],
                     "rows":[
                        [
                           "1st",
                           "{@spell entangle}, {@spell inflict wounds}"
                        ],
                        [
                           "2nd",
                           "{@spell alter self}, {@spell spike growth}"
                        ],
                        [
                           "3rd",
                           "{@spell haste}, {@spell stinking cloud}"
                        ],
                        [
                           "4th",
                           "{@spell blight}, {@spell greater invisibility}"
                        ],
                        [
                           "5th",
                           "{@spell bigby's hand}, {@spell destructive wave}"
                        ]
                     ]
                  }
               ]
            },
            {
               "type":"refSubclassFeature",
               "subclassFeature":"Parasite Embrace|Warlock||Parasite|JS|1"
            }
         ]
      },
      {
         "name":"Parasite Embrace",
         "source":"JS",
         "className":"Warlock",
         "classSource":"PHB",
         "subclassShortName":"Parasite",
         "subclassSource":"JS",
         "level":1,
         "entries":[
            "Starting at 1st level, you gain the ability to change the Parasite in your body to a more advantageous form. When you finish a short or long rest you can choose one of the following benefits:",
            {
               "type":"list",
               "items":[
                  "You gain temporary hit points equal to your proficiency bonus at the start of each of your turns.",
                  "You grow natural melee weapons such as claws, fangs, spines, horns, or you might turn your hands into razor sharp blades, depending on your choice. This does not diminish the functionality of your appendages. Your natural weapons deal 1d6 bludgeoning, piercing, or slashing damage, as appropriate to the form of weapon you chose, and you are proficient with your natural weapons and you can use Dexterity instead of Strength for the attack and damage rolls of your natural weapons. Finally, when you use the Attack action with a natural melee weapon on your turn, you can make one attack with your natural melee weapon as a bonus action. "
               ]
            },
            "This feature lasts until you finish a short or long rest.",
            "If you later gain the Pact of the Chain feature, these features extend to your familiar as well, but it is still limited to one attack.",
            "Once you reach 10th level in this class, after finishing a short or long rest you gain both of these features and you can change your natural weapon type as a free action."
         ]
      },
      {
         "name":"Extra Attack",
         "source":"JS",
         "className":"Warlock",
         "classSource":"PHB",
         "subclassShortName":"Parasite",
         "subclassSource":"JS",
         "level":6,
         "entries":[
            "At 6th level, you can attack with your natural weapons twice, instead of once, whenever you take the Attack action on your turn. ",
            "Your natural weapons count as magical for the purpose of overcoming resistance and immunity to non-magical attacks and damage."
         ]
      },
      {
         "name":"Parasite Adaptation",
         "source":"JS",
         "className":"Warlock",
         "classSource":"PHB",
         "subclassShortName":"Parasite",
         "subclassSource":"JS",
         "level":6,
         "entries":[
            "Starting at 6th level, your Parasite has observed your surroundings and can adapt you even further depending on your situational needs.",
            "You can use your action to gain one of the following benefits:",
            {
               "type":"list",
               "items":[
                  "You grow wings and gain a flying speed of 30 feet.",
                  "You sprout gills, and grow webbing between your fingers. You can also breathe underwater and gain a swimming speed equal to your walking speed.",
                  "You gain darkvision out to a range of 60 feet and you can move up, down, and across vertical surfaces and upside down along ceilings, while leaving your hands free. You also gain a climbing speed equal to your walking speed.",
                  "You gain resistance to one type of damage of your choice."
               ]
            },
            "This feature lasts until you finish a short or long rest.",
            "If you later gain the Pact of the Chain feature, these features extend to your familiar as well, but it is still limited to one attack.",
            "Once you reach 10th level in this class, after finishing a short or long rest you gain both of these features and you can change your natural weapon type as a free action."
         ]
      },
      {
         "name":"Parasite Segmentation",
         "source":"JS",
         "className":"Warlock",
         "classSource":"PHB",
         "subclassShortName":"Parasite",
         "subclassSource":"JS",
         "level":10,
         "entries":[
            "Beginning at 10th level, you can create a duplicate of yourself. ",
            "As an action, you create a perfect copy of yourself that lasts for 1 minute, or until you lose your concentration (as if you were concentrating on a spell). The copy appears in an unoccupied space right beside you. ",
            "As a bonus action on your turn, you can command the copy to move up to 30 feet to a space you can see and take an action, but it must remain within 60 feet of you. For the duration, you can cast spells as though you were in the copy’s space, but you must use your own senses.",
            "The copy is unable to cast spells of its own. You and your copy start with the same hit points and you have the same stats. It can make two attacks with its natural weapons using your modifiers as part of its action when you command it with your bonus action.",
            "Once you use this feature, you can’t use it again until you finish a short or long rest.",
            "If you have the Pact of the Chain feature, your familiar becomes the duplicate instead, but you can command it with your bonus action, as it will now act as part of your turn. You can swap positions with your familiar once as a free action, using this feat. When your copy expires, it turns back into your familiar. If your copy drops to 0 hit points, it reverts back and any excess damage it takes, carries over to its normal form. "
         ]
      },
      {
         "name":"Parasite Assimilation",
         "source":"JS",
         "className":"Warlock",
         "classSource":"PHB",
         "subclassShortName":"Parasite",
         "subclassSource":"JS",
         "level":14,
         "entries":[
            "Starting at 14th level, your Parasite can take control of your body, acting on your behalf for a limited amount of time, granting you its full powers. This does not take away your control as a Player.",
            "You can use an action to increase your size by one category for one hour. You can return to your normal size early, if you end this effect as a free action. You benefit from these abilities while your size is increased in this way:",
            {
               "type":"list",
               "items":[
                  "You gain a +1 bonus to all attack and damage rolls. ",
                  "Your natural weapons deal 2d6 damage instead of 1d6 damage.",
                  "You gain a number of temporary hit points equals 20 plus your warlock level. When the form ends, you lose any temporary hit points you have from it.",
                  "You have advantage on all Strength ability checks and saving throws. "
               ]
            },
            "While in this form, you can't concentrate on spells or spell-like abilities. ",
            "When you exit this form, you gain one level of exhaustion. This ability ends early if you die.",
            "Once you use this feature, you can’t use it again until you finish a short or long rest."
         ]
      },
      {
         "name":"Way of the Fractured Shifter",
         "source":"JS",
         "className":"Monk",
         "classSource":"PHB",
         "subclassShortName":"Fractured Shifter",
         "subclassSource":"JS",
         "level":3,
         "entries":[
            "Monks of the Way of the Fractured Shifter train their body and soul to become elusive as a ghost. Meant to guard the Border Ethereal Plane, these monks weave in and out of the mists as they strike like a shrieking banshee. A shifter can reach beyond the veil of the Ethereal Plane and bring a part of it with them, or drag those who threaten its peace into the mists to isolate them.",
            "Monks of the Way of the Fractured Shifter often work alongsides those who have the same goals as them, like Horizon Walkers, even though their tradition sometimes isolates them from the living for years.",
            {
               "type":"refSubclassFeature",
               "subclassFeature":"Etherial Arts|Monk||Fractured Shifter|JS|3"
            }
         ]
      },
      {
         "name":"Etherial Arts",
         "source":"JS",
         "className":"Monk",
         "classSource":"PHB",
         "subclassShortName":"Fractured Shifter",
         "subclassSource":"JS",
         "level":3,
         "header":1,
         "entries":[
            "Starting when you choose this tradition at 3rd level, you can tap into the Border Ethereal Plane, granting you the following benefits.",
            {
               "type":"entries",
               "name":"Disembodied Stance.",
               "entries":[
                  "On your turn, you can spend 1 ki point to wrap yourself in a ghostly haze. You end any frightended condition on you and you become immune to being frightened until the end of your next turn.",
                  "Until the end of your next turn, you can spend 1 ki point when you hit a creature with an attack to deal an extra 1d10 necrotic damage."
               ]
            },
            {
               "type":"entries",
               "name":"Uncanny Performance.",
               "entries":[
                  "While Disembodied Stance is active, you can use your ki to duplicate the effects of certain spells. You can spend 1 ki point to cast {@spell Blur} and {@spell Fog Cloud} as an action, or {@spell Misty Step} as a bonus action, without providing material components. When you reach 6th level in this class, you can spend 2 ki points as an action to cast {@spell Blink} while Disembodied Stance is active.",
                  "Additionally, you gain the {@spell Mage Hand} cantrip if you don't already know it."
               ]
            }
         ]
      },
      {
         "name":"Sway of the Mist",
         "source":"JS",
         "className":"Monk",
         "classSource":"PHB",
         "subclassShortName":"Fractured Shifter",
         "subclassSource":"JS",
         "level":6,
         "header":1,
         "entries":[
            "At 6th level, you gain the ability to draw more energy from the Ethereal Plane. While Disembodied Stance is active you can choose one of the following benefits:",
            {
               "type":"list",
               "items":[
                  "You can move through other creatures as if they were difficult terrain. You take {@damage 1d10} force damage, if you end your turn inside a creature and you will be ejected to an unoccupied space nearest the creature.",
                  "Your movement doesn't provoke opportunity attacks.",
                  "Your movement leaves a trail of mist which creates a 5 foot wide and 10 foot high wall of fog. Its area is heavily obscured and it dissipates at the start of your next turn."
               ]
            }
         ]
      },
      {
         "name":"Phasing Strike",
         "source":"JS",
         "className":"Monk",
         "classSource":"PHB",
         "subclassShortName":"Fractured Shifter",
         "subclassSource":"JS",
         "level":6,
         "header":1,
         "entries":[
            "At 6th level, when you hit a creature with both of the attacks of your Flurry of Blows on the same turn, you can attempt to shift the creature into the Border Ethereal Plane. The target must succeed on a Charisma saving throw or be shifted until the end of your next turn. While there, the target can see and hear the plane they originated from, which is cast in shades of gray, and they can’t see anything there more than 60 feet away. They can only affect and be affected by other creatures on the Ethereal Plane. Creatures that aren’t there can’t perceive them or interact with them, unless they have the ability to do so. At the end of your next turn, the shifted creature reappears in the space it currently stands or in the nearest unoccupied space if that space is occupied. If this ability is used on a plane other than the Inner Planes, you banish the target to a harmless demiplane which behaves in the same manner."
         ]
      },
      {
         "name":"Open the Border",
         "source":"JS",
         "className":"Monk",
         "classSource":"PHB",
         "subclassShortName":"Fractured Shifter",
         "subclassSource":"JS",
         "level":11,
         "header":1,
         "entries":[
            "At 11th level, your connection to the Ethereal Plane becomes so strong, that it manifests around you, granting the following benefits.",
            {
               "type":"entries",
               "name":"Aura of Mist.",
               "entries":[
                  "Your influence over the Border Ethereal Plane spreads to your companions. Your Sway of the Mist traits extend to up to a number of willing creatures within 30 feet of you, that you can see, equal to your Wisdom modifier (minimum of 1)."
               ]
            },
            {
               "type":"entries",
               "name":"Phase Step.",
               "entries":[
                  "You can move up and down as it is possible in the Border Ethereal Plane. You gain a flying speed equal to your walking speed for a minute when you activate Disembodied Stance."
               ]
            }
         ]
      },
      {
         "name":"Phantom Soul",
         "source":"JS",
         "className":"Monk",
         "classSource":"PHB",
         "subclassShortName":"Fractured Shifter",
         "subclassSource":"JS",
         "level":17,
         "header":1,
         "entries":[
            "Starting at 17th level, You can enter and leave the Ethereal Plane, at will. Entering and leaving requires you to spend a minute in uninterrupted meditation. While in the Ethereal Plane, your unarmed strikes can affect those on the Material Plane, you can see and hear the plane you originated from, which is cast in shades of gray, and you can’t see anything there more than 60 feet away. You can only be affected by other creatures on the Ethereal Plane. Creatures that aren’t there can’t perceive you or interact with you, unless they have the ability to do so.",
            "When you attack or cast a spell, an image of yourself bleeds into the plane you originate from, allowing you to be seen from said plane. When an attack made against the image would hit you, or when you fail a saving throw which was meant for your image, it has no effect on you, instead, you roll a d6. When you roll a 6, you stay in the Etherial Plane. On a 1-5, you get knocked out of the Etherial Plane.",
            "Furthermore, you can spend 5 ki points to cast {@spell Plane Shift}, without providing material components. You can only shift yourself and others to the Ehereal Plane and back."
         ]
      }
   ],
   "race":[
      
   ],
   "language":[
      
   ]
}