{
   "_meta":{
      "sources":[
         {
            "json":"tCCSG",
            "abbreviation":"tCCSG",
            "full":"The Cook Class",
            "authors":[
               "Sam Grierson"
            ],
            "color":"7c97d6",
            "convertedBy":[
               "BluMasc"
            ],
            "version":"2.1",
            "url":"https://www.dmsguild.com/product/232212/The-Cook-Class",
            "targetSchema":"1.6.3"
         }
      ],
      "dependencies":{
         "monster":[
            "MM",
            "SaF"
         ]
      }
   },
   "class":[
      {
         "name":"Cook",
         "source":"tCCSG",
         "shortName":"Cook",
         "hd":{
            "number":1,
            "faces":8
         },
         "proficency":[
            "con",
            "cha"
         ],
         "startingProficiencies":{
            "armor":[
               "light",
               "medium"
            ],
            "tools":[
               "{@item cook's utensils|PHB}"
            ],
            "weapons":[
               "simple",
               "{@item hand crossbow|phb|hand crossbows}",
               "{@item longsword|phb|longswords}",
               "{@item rapier|phb|rapiers}",
               "{@item shortsword|phb|shortswords}"
            ],
            "skills":[
               {
                  "choose":{
                     "from":[
                        "animal handling",
                        "arcana",
                        "athletics",
                        "medicine",
                        "nature",
                        "performance",
                        "persuasion",
                        "sleight of hand",
                        "survival"
                     ],
                     "count":3
                  }
               }
            ]
         },
         "startingEquipment":{
            "default":[
               "(a) a longsword or (b) a hand crossbow and 20 bolts",
               "(a) leather armor or (b) scale mail",
               "(a) two daggers or (b) two light hammers",
               "(a) an explorer’s pack or (b) a scholar’s pack",
               "Cook’s Utensils and a Cook’s Bag"
            ],
            "defaultData":[
               {
                  "a":[
                     
                  ],
                  "b":[
                     
                  ]
               },
               {
                  "a":[
                     
                  ],
                  "b":[
                     
                  ]
               },
               {
                  "a":[
                     
                  ],
                  "b":[
                     
                  ]
               },
               {
                  "a":[
                     
                  ],
                  "b":[
                     
                  ]
               },
               {
                  "_":[
                     
                  ]
               }
            ]
         },
         "multiclassing":{
            "requirements":{
               "con":13
            },
            "proficienciesGained":{
               "armor":[
                  "light",
                  "medium"
               ],
               "weapons":[
                  "simple",
                  "martial"
               ],
               "tools":[
                  "{@item cook's utensils|PHB}"
               ],
               "skills":[
                  {
                     "choose":{
                        "from":[
                           "animal handling",
                           "arcana",
                           "athletics",
                           "medicine",
                           "nature",
                           "performance",
                           "persuasion",
                           "sleight of hand",
                           "survival"
                        ],
                        "count":1
                     }
                  }
               ]
            }
         },
         "classTableGroups":[
            {
               "colLabels":[
                  "Morsels"
               ],
               "rows":[
                  [
                     3
                  ],
                  [
                     3
                  ],
                  [
                     4
                  ],
                  [
                     5
                  ],
                  [
                     6
                  ],
                  [
                     7
                  ],
                  [
                     8
                  ],
                  [
                     9
                  ],
                  [
                     10
                  ],
                  [
                     11
                  ],
                  [
                     12
                  ],
                  [
                     12
                  ],
                  [
                     13
                  ],
                  [
                     13
                  ],
                  [
                     14
                  ],
                  [
                     14
                  ],
                  [
                     15
                  ],
                  [
                     15
                  ],
                  [
                     15
                  ],
                  [
                     15
                  ]
               ]
            }
         ],
         "classFeatures":[
            "Cook's Bag|Cook|tCCSG|1",
            "Morsels|Cook|tCCSG|1",
            "Smelling Salts|Cook|tCCSG|1",
            "Expertise|Cook|tCCSG|2",
            {
               "classFeature":"Cook Archetype|Cook|tCCSG|3",
               "gainSubclassFeature":true
            },
            "Ability Score Improvement|Cook|tCCSG|4",
            "Rotund Reflection|Cook|tCCSG|5",
            {
               "classFeature":"Cook Archetype Feature|Cook|tCCSG|6",
               "gainSubclassFeature":true
            },
            "Order Up|Cook|tCCSG|7",
            "Smelling Salts Improved|Cook|tCCSG|7",
            "Ability Score Improvement|Cook|tCCSG|8",
            "Expertise|Cook|tCCSG|9",
            "Iron Stomach|Cook|tCCSG|9",
            {
               "classFeature":"Cook Archetype Feature|Cook|tCCSG|10",
               "gainSubclassFeature":true
            },
            "Order Up Improved|Cook|tCCSG|11",
            "Ability Score Improvement|Cook|tCCSG|12",
            "Smelling Salts Improved|Cook|tCCSG|13",
            {
               "classFeature":"Cook Archetype Feature|Cook|tCCSG|14",
               "gainSubclassFeature":true
            },
            "Soul of Food|Cook|tCCSG|15",
            "Ability Score Improvement|Cook|tCCSG|16",
            "Fulfilling Meal|Cook|tCCSG|17",
            "Smelling Salts Improved|Cook|tCCSG|17",
            {
               "classFeature":"Cook Archetype Feature|Cook|tCCSG|18",
               "gainSubclassFeature":true
            },
            "Ability Score Improvement|Cook|tCCSG|19",
            "Leftovers|Cook|tCCSG|20"
         ],
         "subclassTitle":"Cook Archetype",
         "fluff":[
            {
               "name":"The Cook",
               "type":"section",
               "entries":[
                  "A half-orc throws a perfectly seasoned chicken leg at his dwarven friend, lands it directly in her mouth. As a horde of goblins charge the dwarf, she begins nibbling, her arms swell, and she swipes away three of the charging goblins with a single swipe of her shield. The half-orc wipes his greasy hands on his apron and smiles.",
                  "A halfling stares a dragon down over a mile of open field. As the dragon inhales deeply, she pulls out a roasted pepper and chomps down. She begins to sweat profusely. The dragon breathes fire, and the halfling charges straight on through.",
                  "A human mixes the contents of a boiling pot and looks around at all his friends, tired and spent, but he’ll see to it that that doesn’t last too long.",
                  "Cooks are the much-forgotten caretakers of every band of heroes, for a dragon-slaying barbarian can always die of hunger. Through tasty foods cooks strengthen their allies and debilitate their foes, commanding incredible control over any battle.",
                  {
                     "type":"entries",
                     "name":"Food as Craft",
                     "entries":[
                        "Anyone can throw meat atop a fire, but only cooks can make that meat sing. Just as an artist can watch a child paint their house, so too does the cook look at the typical kitchen. They may laugh or smile or even snarl at the naivety presented, but they all recognize it as simple, basic. Meals are more than a collection of ingredients to a cook.",
                        "Every creature is suffused with the same magical energy that binds the multiverse together. Cooks have, knowingly or unknowingly, learned to tap into the magic of creatures through food, the source of their vitality, and cooks use their craft to shape it.",
                        "Their talents put cooks above the common people, and that’s where you’ll find them: Some traveling with adventurers who’ve wrestled with giants, giving those adventurers the power to succeed. Some see their bodies as test subjects, formulating dietary plans to improve themselves beyond the normal limits of their species. Some even find a way to take advantage of the senses, and create food that is not meant to improve but to hinder, to weaken, to destroy. Cooks understand how finely tuned a body is, especially once you get inside it, and they know how to make or break it."
                     ]
                  },
                  {
                     "type":"entries",
                     "name":"A Life of Servitude",
                     "entries":[
                        "Cooks are on a constant search, a search for the perfect flavor, the best diet, the choicest ingredients. The meeker ones find employ with wealthy manors or in gritty taverns, but the ones with ambition know that their search could not end in a stuffy kitchen beholden to the bland tastes of big wigs and commoners.",
                        "Bold adventurers come with bold tongues, and they are the only hope of an end to a cook’s journey. True cooks offer their services only to those proven worthy of the food they will prepare. Adventurers rip the essence out of life, and cooks take that essence and throw it in their pot. Cooks will keep these adventurers alive and fed until their personal quests find completion."
                     ]
                  }
               ]
            }
         ]
      }
   ],
   "classFeature":[
      {
         "name":"Cook's Bag",
         "source":"tCCSG",
         "className":"Cook",
         "classSource":"tCCSG",
         "level":1,
         "entries":[
            "At first level, you craft a Cook's Bag, a bag that magically preserves not only your morsels (described below), but also the ingredients required to make them.",
            "You must replenish these ingredients at least once every 30 days. When you do so, you can buy 10 gp worth of food from a market, or you can spend 8 hours scavenging food from your surroundings.",
            "If you lose this bag, you can create a new one by expending 100 gp worth of leather, gems, and other raw materials. Doing so takes 8 hours of work."
         ]
      },
      {
         "name":"Morsels",
         "source":"tCCSG",
         "className":"Cook",
         "classSource":"tCCSG",
         "level":1,
         "entries":[
            "Years of cooking have taught you that every meal has that one perfect bite, a {@filter Morsel|optionalfeatures|feature type=Morsel|source=tCCSG} where all the ingredients mix together into something truly special. You have learned how to instill this morsel with magical effects dependent on the ingredients of the morsel. Creatures that ingest your morsels are given these effects.",
            "Choose three morsels of your choice, detailed at the end of the class description. These are the morsels that you can prepare. A creature can only be under the effects of one morsel at a time. If a creature is under the effects of a morsel, and they ingest another morsel, the original effect ends.",
            "You learn how to prepare additional types of morsels as you level as detailed in the Cook Table. Each time you gain a level, you can replace one morsel you know with a different one.",
            "You can cook a number of morsels equal to your Constitution modifier every short or long rest. You can cook the same type of morsel more than once. All morsels are stored in your Cook’s Bag and expire if taken out for longer than 6 seconds, or the next time you cook morsels.",
            "You can use your action to feed a morsel to a creature. When you do so, you reach into your Cook’s bag, pull out a morsel, and feed it to a conscious creature you can touch. They ingest it immediately. You must have a free hand to feed a morsel.",
            "Some of your morsels require your target to make a saving throw to resist the effect. The saving throw DC is calculated as follows.",
            {
               "type":"abilityDc",
               "name":"Morsel",
               "attributes":[
                  "con"
               ]
            },
            "Creatures who do not have mouths or analogous orifices can still be affected by your morsels. Mere contact with your morsels imparts a weakened effect. If a creature cannot ingest your morsel, it has advantage on any saving throws it makes against the morsel's effect."
         ]
      },
      {
         "name":"Smelling Salts",
         "source":"tCCSG",
         "className":"Cook",
         "classSource":"tCCSG",
         "level":1,
         "entries":[
            "At 1st level, you discover a mix of spices that creates such a visceral and powerful assault on the nose as to break a creature from its stupor. You can use a bonus action to choose one creature that you can touch. You wave the spices under the creature's nose, and it can immediately repeat a saving throw against one condition it currently has, ending the condition on a success. The condition can be the Charmed or Frightened condition.",
            "Once a creature repeats a saving throw with this feature, it cannot do so again until it finishes a short or long rest."
         ]
      },
      {
         "name":"Expertise",
         "source":"tCCSG",
         "className":"Cook",
         "classSource":"tCCSG",
         "level":2,
         "entries":[
            "At 2nd level, choose two of your skill proficiencies, or one of your skill proficiencies and your proficiency with cook's utensils. Your proficiency bonus is doubled for any ability check you make that uses either of the chosen proficiencies."
         ]
      },
      {
         "name":"Cook Archetype",
         "source":"tCCSG",
         "className":"Cook",
         "classSource":"tCCSG",
         "level":3,
         "entries":[
            "At 3rd level, you choose an archetype that you emulate in the exercise of your cook abilities: Sous Chef, Mess Sergeant, Hash Slinger, Brewmeister, or Monster Masher, all detailed at the end of the class description. Your archetype choice grants you features at 3rd level and then again at 6th , 10th, 14th, and 18th level."
         ]
      },
      {
         "name":"Ability Score Improvement",
         "source":"tCCSG",
         "className":"Cook",
         "classSource":"tCCSG",
         "level":4,
         "entries":[
            "When you reach 4th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature."
         ]
      },
      {
         "name":"Rotund Reflection",
         "source":"tCCSG",
         "className":"Cook",
         "classSource":"tCCSG",
         "level":5,
         "entries":[
            "At 5th level, you gain the ability to repel enemies that attack you. Your stomach is of utmost importance, and you have toned your belly to be tough and somewhat gelatinous. When a Large or smaller creature within 5 feet of you hits you with a melee attack, you can use your reaction to cause the creature to make a Dexterity saving throw against your Morsel save DC. On a failed save, their speed becomes 0 until the end of the turn, and they are either pushed 10 ft. away from you or knocked prone (your choice)."
         ]
      },
      {
         "name":"Cook Archetype Feature",
         "source":"tCCSG",
         "className":"Cook",
         "classSource":"tCCSG",
         "level":6,
         "entries":[
            "At 6th level, you gain a feature granted by your Cook Archetype choice."
         ]
      },
      {
         "name":"Order Up",
         "source":"tCCSG",
         "className":"Cook",
         "classSource":"tCCSG",
         "level":7,
         "entries":[
            "Beginning at 7th level, when you make morsels during a long rest, you can make a number of additional morsels equal to your Constitution ability modifier, none of which can have prerequisites."
         ]
      },
      {
         "name":"Smelling Salts Improved",
         "source":"tCCSG",
         "className":"Cook",
         "classSource":"tCCSG",
         "level":7,
         "entries":[
            "At 7th level, the chosen condition for your smelling salts can be the Stunned condition."
         ]
      },
      {
         "name":"Ability Score Improvement",
         "source":"tCCSG",
         "className":"Cook",
         "classSource":"tCCSG",
         "level":8,
         "entries":[
            "When you reach 8th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature."
         ]
      },
      {
         "name":"Expertise",
         "source":"tCCSG",
         "className":"Cook",
         "classSource":"tCCSG",
         "level":9,
         "entries":[
            "At 9th level, choose two of your skill proficiencies, or one of your skill proficiencies and your proficiency with cook's utensils. Your proficiency bonus is doubled for any ability check you make that uses either of the chosen proficiencies."
         ]
      },
      {
         "name":"Iron Stomach",
         "source":"tCCSG",
         "className":"Cook",
         "classSource":"tCCSG",
         "level":9,
         "entries":[
            "At 9th level, a lifetime of eating any and all sorts of foods has prepared your stomach for anything. You are immune to any ingested poisons and the poisoned condition."
         ]
      },
      {
         "name":"Cook Archetype Feature",
         "source":"tCCSG",
         "className":"Cook",
         "classSource":"tCCSG",
         "level":10,
         "entries":[
            "At 10th level, you gain a feature granted by your Cook Archetype choice."
         ]
      },
      {
         "name":"Order Up Improved",
         "source":"tCCSG",
         "className":"Cook",
         "classSource":"tCCSG",
         "level":11,
         "entries":[
            "At 11th level, you can make your additional order up morsels during a short rest as well as during a long rest."
         ]
      },
      {
         "name":"Ability Score Improvement",
         "source":"tCCSG",
         "className":"Cook",
         "classSource":"tCCSG",
         "level":12,
         "entries":[
            "When you reach 12th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature."
         ]
      },
      {
         "name":"Smelling Salts Improved",
         "source":"tCCSG",
         "className":"Cook",
         "classSource":"tCCSG",
         "level":13,
         "entries":[
            "At 13th level, the chosen condition for your smelling salts can be the Paralyzed condition."
         ]
      },
      {
         "name":"Cook Archetype Feature",
         "source":"tCCSG",
         "className":"Cook",
         "classSource":"tCCSG",
         "level":14,
         "entries":[
            "At 14th level, you gain a feature granted by your Cook Archetype choice."
         ]
      },
      {
         "name":"Soul of Food",
         "source":"tCCSG",
         "className":"Cook",
         "classSource":"tCCSG",
         "level":15,
         "entries":[
            "At 15th level, you have attuned your body's life force to the nourishing energies of the world. You can cast Create Food and Water once with this feature and regain the ability to do so when you finish a long rest. When you do so, you create 100 gold pieces worth of food that is not bland, but flavorful and enjoyable.",
            "In addition, if you make morsels, and you have no ingredients left, you conjure the necessary ingredients as part of making the morsels."
         ]
      },
      {
         "name":"Ability Score Improvement",
         "source":"tCCSG",
         "className":"Cook",
         "classSource":"tCCSG",
         "level":16,
         "entries":[
            "When you reach 16th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature."
         ]
      },
      {
         "name":"Fulfilling Meal",
         "source":"tCCSG",
         "className":"Cook",
         "classSource":"tCCSG",
         "level":17,
         "entries":[
            "At 17th level, whenever you feed a morsel to a creature that you have shared a long rest with (including yourself), you can double the duration of the morsel’s effect."
         ]
      },
      {
         "name":"Smelling Salts Improved",
         "source":"tCCSG",
         "className":"Cook",
         "classSource":"tCCSG",
         "level":17,
         "entries":[
            "At 17th level, the chosen creature of your smelling salts has advantage on the repeated saving throw."
         ]
      },
      {
         "name":"Cook Archetype Feature",
         "source":"tCCSG",
         "className":"Cook",
         "classSource":"tCCSG",
         "level":18,
         "entries":[
            "At 18th level, you gain a feature granted by your Cook Archetype choice."
         ]
      },
      {
         "name":"Ability Score Improvement",
         "source":"tCCSG",
         "className":"Cook",
         "classSource":"tCCSG",
         "level":19,
         "entries":[
            "When you reach 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature."
         ]
      },
      {
         "name":"Leftovers",
         "source":"tCCSG",
         "className":"Cook",
         "classSource":"tCCSG",
         "level":20,
         "entries":[
            "At 20th level, when you roll initiative and have no morsels left, you conjure one morsel that you know how to prepare inside your Cook's Bag."
         ]
      }
   ],
   "subclassFeature":[
      {
         "name":"Sous Chef",
         "source":"tCCSG",
         "className":"Cook",
         "classSource":"tCCSG",
         "subclassShortName":"Sous",
         "subclassSource":"tCCSG",
         "level":3,
         "entries":[
            "The archetypal Sous Chef believes that their allies are more than worthy of their cooking. They have proven that their stomachs can make the most of the powers instilled in morsels, and a Sous Chef will use that power to safeguard their health at all costs.",
            {
               "type":"refSubclassFeature",
               "subclassFeature":"We Deliver|Cook|tCCSG|Sous|tCCSG|3"
            }
         ]
      },
      {
         "name":"We Deliver",
         "source":"tCCSG",
         "className":"Cook",
         "classSource":"tCCSG",
         "subclassShortName":"Sous",
         "subclassSource":"tCCSG",
         "level":3,
         "entries":[
            "At 3rd level, you become a caretaker of heroes, ready at any moment to help your allies, even at range. When you feed a morsel to a willing creature, the creature you feed can be up to 30 feet away from you, so long as you can see them, and their mouth is not blocked by total cover. You throw the morsel directly into their mouth, and they ingest it immediately.",
            "Additionally, when you feed a morsel to a willing creature that you can touch (other than yourself), you can do so as a bonus action."
         ]
      },
      {
         "name":"Secret Sauce",
         "source":"tCCSG",
         "className":"Cook",
         "classSource":"tCCSG",
         "subclassShortName":"Sous",
         "subclassSource":"tCCSG",
         "level":6,
         "entries":[
            "At 6th level, you create a signature sauce that you dab onto all of your beneficial morsels. Whenever you feed a morsel to a friendly creature, it regains a number of hit points equal to your Constitution modifier."
         ]
      },
      {
         "name":"Aromatic Scent",
         "source":"tCCSG",
         "className":"Cook",
         "classSource":"tCCSG",
         "subclassShortName":"Sous",
         "subclassSource":"tCCSG",
         "level":10,
         "entries":[
            "By 10th level, the continuous consumption of culinary delights has infused your body with a thousand revitalizing smells that stir your companions to action. As an action you can expel these smells in one powerful wave. All friendly creatures (including yourself) within 30 feet of you that you can see regain a number of hit points equal to your Cook Level, and they can each immediately use their reaction to make a single weapon attack or cast one cantrip they know that requires an attack roll or saving throw (their choice).",
            "Once you use this feature, you must finish a long rest before you can use it again."
         ]
      },
      {
         "name":"Magnificent Meal",
         "source":"tCCSG",
         "className":"Cook",
         "classSource":"tCCSG",
         "subclassShortName":"Sous",
         "subclassSource":"tCCSG",
         "level":14,
         "entries":[
            "Beginning at 14th level, you can prepare a magical feast that strengthens both body and will. You gain the ability to cast the Heroes' Feast spell. When you do so, you replace the material components of the spell with fine foods worth at least 500 gp, which the spell consumes.",
            "Once you cast Heroes' Feast in this way, you cannot do so again until you have finished a long rest."
         ]
      },
      {
         "name":"Legendary Morsel",
         "source":"tCCSG",
         "className":"Cook",
         "classSource":"tCCSG",
         "subclassShortName":"Sous",
         "subclassSource":"tCCSG",
         "level":18,
         "entries":[
            "At 18th level, you gain the ability to make the following morsel when you take a long rest. When you do so, you can make only one. It doesn't expire until your next long rest, and it doesn't count against the total number of morsels you can prepare.",
            "{@optfeature Monkey’s Brains|tCCSG}"
         ]
      },
      {
         "name":"Mess Sergeant",
         "source":"tCCSG",
         "className":"Cook",
         "classSource":"tCCSG",
         "subclassShortName":"Mess",
         "subclassSource":"tCCSG",
         "level":3,
         "entries":[
            "The archetypal Mess Sergeant believes in a stringent diet, complete control over what goes in and out of one’s body. They seek bodily perfection through a calculated input of just the right nutrients, and they are overjoyed by any chance to show off their physical prowess.",
            {
               "type":"refSubclassFeature",
               "subclassFeature":"Never Satisfied|Cook|tCCSG|Mess|tCCSG|3"
            }
         ]
      },
      {
         "name":"Never Satisfied",
         "source":"tCCSG",
         "className":"Cook",
         "classSource":"tCCSG",
         "subclassShortName":"Mess",
         "subclassSource":"tCCSG",
         "level":3,
         "entries":[
            "At 3rd level you gain the ability to eat very quickly. On your turn, you can feed a morsel to yourself as a bonus action.",
            "Additionally, your healthy appetite bolsters your health. Your hit point maximum immediately increases by 3 and increases by 1 whenever you gain a level in this class."
         ]
      },
      {
         "name":"Raucous Belch",
         "source":"tCCSG",
         "className":"Cook",
         "classSource":"tCCSG",
         "subclassShortName":"Mess",
         "subclassSource":"tCCSG",
         "level":6,
         "entries":[
            "At 6th level, you gain the ability to taunt your foes with a loud and odorous burp. As an action you can have each hostile creature in a 10 foot cone originating from you make a Wisdom saving throw against your Morsel save DC. On a failed save, the target(s) have disadvantage on attack rolls against all creatures other than you until the start of your next turn.",
            "You can use this feature a number of times equal to your Constitution modifier (minimum of once). You regain all expended uses when you finish a long rest."
         ]
      },
      {
         "name":"Sturdy Stomach",
         "source":"tCCSG",
         "className":"Cook",
         "classSource":"tCCSG",
         "subclassShortName":"Mess",
         "subclassSource":"tCCSG",
         "level":10,
         "entries":[
            "At 10th level, you can be under the effects of two morsels at the same time.",
            "If you are under the effects of two morsels and ingest a third morsel, you lose one of the original effects (your choice)."
         ]
      },
      {
         "name":"Strict Diet",
         "source":"tCCSG",
         "className":"Cook",
         "classSource":"tCCSG",
         "subclassShortName":"Mess",
         "subclassSource":"tCCSG",
         "level":14,
         "entries":[
            "At 14th level your diet optimizes your body beyond its normal limits. Choose Strength, Dexterity, or Constitution. Increase the ability score of the chosen ability by 2, and the limit for that ability score becomes 22."
         ]
      },
      {
         "name":"Legendary Morsel",
         "source":"tCCSG",
         "className":"Cook",
         "classSource":"tCCSG",
         "subclassShortName":"Mess",
         "subclassSource":"tCCSG",
         "level":18,
         "entries":[
            "At 18th level, you gain the ability to make the following morsel when you take a long rest. When you do so, you can make only one. It doesn't expire until your next long rest, and it doesn't count against the total number of morsels you can prepare.",
            "{@optfeature Crytalline Heart|tCCSG}"
         ]
      },
      {
         "name":"Hash Slinger",
         "source":"tCCSG",
         "className":"Cook",
         "classSource":"tCCSG",
         "subclassShortName":"Hash",
         "subclassSource":"tCCSG",
         "level":3,
         "entries":[
            "The archetypal Hash Slinger believes more in the scientific aspect of food than in the art of it. Food is the fuel, and the body is the fire. If you can control the fuel, you can control the fire.",
            {
               "type":"refSubclassFeature",
               "subclassFeature":"Bonus Proficiencies|Cook|tCCSG|Hash|tCCSG|3"
            },
            {
               "type":"refSubclassFeature",
               "subclassFeature":"We Deliver Death|Cook|tCCSG|Hash|tCCSG|3"
            }
         ]
      },
      {
         "name":"Bonus Proficiencies",
         "source":"tCCSG",
         "className":"Cook",
         "classSource":"tCCSG",
         "subclassShortName":"Hash",
         "subclassSource":"tCCSG",
         "level":3,
         "entries":[
            "When you become a Hash Slinger at 3rd level, you gain proficiency with martial weapons."
         ]
      },
      {
         "name":"We Deliver Death",
         "source":"tCCSG",
         "className":"Cook",
         "classSource":"tCCSG",
         "subclassShortName":"Hash",
         "subclassSource":"tCCSG",
         "level":3,
         "entries":[
            "Also at 3rd level, you gain the ability to feed your enemies at range. When you feed a morsel to a hostile creature, the creature you feed can be up to 30 feet away from you, so long as you can see them, and their mouth or analogous orifice is not blocked by total cover. You throw the morsel directly into their mouth or analogous orifice, and they ingest it immediately."
         ]
      },
      {
         "name":"Extra Attack",
         "source":"tCCSG",
         "className":"Cook",
         "classSource":"tCCSG",
         "subclassShortName":"Hash",
         "subclassSource":"tCCSG",
         "level":6,
         "entries":[
            "Beginning at 6th level, you can attack twice, instead of once, whenever you take the Attack action on your turn."
         ]
      },
      {
         "name":"Horrific Stench",
         "source":"tCCSG",
         "className":"Cook",
         "classSource":"tCCSG",
         "subclassShortName":"Hash",
         "subclassSource":"tCCSG",
         "level":10,
         "entries":[
            "At 10th level, your food-based experiments have weaved a sickening and distracting smell into your body that releases when you're in danger. Whenever a hostile creature within 10 feet of you makes an ability check or saving throw, they subtract {@dice 1d4} from their roll."
         ]
      },
      {
         "name":"Noxious Strike",
         "source":"tCCSG",
         "className":"Cook",
         "classSource":"tCCSG",
         "subclassShortName":"Hash",
         "subclassSource":"tCCSG",
         "level":14,
         "entries":[
            "At 14th level when a creature makes a saving throw against one of your morsel's effects, you can impose disadvantage on the roll. Once you use this feature, you must finish a short or long rest before you can use it again."
         ]
      },
      {
         "name":"Legendary Morsel",
         "source":"tCCSG",
         "className":"Cook",
         "classSource":"tCCSG",
         "subclassShortName":"Hash",
         "subclassSource":"tCCSG",
         "level":18,
         "entries":[
            "At 18th level, you gain the ability to make the following morsel when you take a long rest. When you do so, you can make only one. It doesn't expire until your next long rest, and it doesn't count against the total number of morsels you can prepare.",
            "{@optfeature Bubbly pill|tCCSG}"
         ]
      },
      {
         "name":"Brewmeister",
         "source":"tCCSG",
         "className":"Cook",
         "classSource":"tCCSG",
         "subclassShortName":"Brew",
         "subclassSource":"tCCSG",
         "level":3,
         "entries":[
            "Where most would see only the danger or the fun in the world's most common vice, the Brewmeister sees potential. Specialists in booze, they study the liquors and ales of the world, each invested with the power of its place, to better craft their own extraordinary brew.",
            {
               "type":"refSubclassFeature",
               "subclassFeature":"Spiked Morsels|Cook|tCCSG|Brew|tCCSG|3"
            }
         ]
      },
      {
         "name":"Spiked Morsels",
         "source":"tCCSG",
         "className":"Cook",
         "classSource":"tCCSG",
         "subclassShortName":"Brew",
         "subclassSource":"tCCSG",
         "level":3,
         "entries":[
            "At 3rd level, you become an expert in alcohol, its benefits and detriments, and you know how to work it into any morsel you prepare.",
            "You gain proficiency with Brewer's Supplies if you don't already have it.",
            "Additionally, when you prepare a morsel, you can choose to spike it, allowing your morsels to build off one another. If a creature is under the effects of a spiked morsel, and they ingest another spiked morsel, the original effect does not end, and the creature becomes intoxicated for 1 minute. An intoxicated creature is immune to the charmed and frightened conditions.",
            "When a creature's intoxication ends, it loses all effects gained from morsels, and the creature can't move or take actions until the end of its next turn as it becomes hungover.",
            "Once a creature has become intoxicated, it can't do so again until it has finished a short or long rest."
         ]
      },
      {
         "name":"Drunken Stumble",
         "source":"tCCSG",
         "className":"Cook",
         "classSource":"tCCSG",
         "subclassShortName":"Brew",
         "subclassSource":"tCCSG",
         "level":6,
         "entries":[
            "Beginning at 6th level, you start to manipulate your alcoholic additions to provide added benefits to intoxicated creatures.",
            "Creatures you intoxicate increase their speed by 10 feet, and other creatures have disadvantage on opportunity attack rolls against them."
         ]
      },
      {
         "name":"Boozy Yield",
         "source":"tCCSG",
         "className":"Cook",
         "classSource":"tCCSG",
         "subclassShortName":"Brew",
         "subclassSource":"tCCSG",
         "level":10,
         "entries":[
            "At 10th level, your brew relaxes the muscles, softening the blow of certain assaults.",
            "Creatures you intoxicate gain resistance to bludgeoning, piercing, and slashing damage from nonmagical weapon attacks."
         ]
      },
      {
         "name":"Angry Drunk",
         "source":"tCCSG",
         "className":"Cook",
         "classSource":"tCCSG",
         "subclassShortName":"Brew",
         "subclassSource":"tCCSG",
         "level":14,
         "entries":[
            "At 14th level, you craft your booze to create a frenzied buzz.",
            "Once per turn, when a creature that you have intoxicated hits a creature with an attack, they can add your Constitution modifier to the damage roll."
         ]
      },
      {
         "name":"Legendary Morsel",
         "source":"tCCSG",
         "className":"Cook",
         "classSource":"tCCSG",
         "subclassShortName":"Brew",
         "subclassSource":"tCCSG",
         "level":18,
         "entries":[
            "At 18th level, you gain the ability to make the following morsel when you take a long rest. When you do so, you can make only one. It doesn't expire until your next long rest, and it doesn't count against the total number of morsels you can prepare.",
            "{@optfeature Master Brew|tCCSG}"
         ]
      },
      {
         "name":"Monster Masher",
         "source":"tCCSG",
         "className":"Cook",
         "classSource":"tCCSG",
         "subclassShortName":"Monster",
         "subclassSource":"tCCSG",
         "level":3,
         "entries":[
            "Most cooks stumble upon the physical power of vitality, or perhaps they simply feel its power in their gut. Monster Mashers cannot stand this ignorance and thus become determined to study the vitality that gives their morsels power. They study all kinds of life, and are always happy to experiment on the living and dead meat.",
            {
               "type":"refSubclassFeature",
               "subclassFeature":"Vital Harvest|Cook|tCCSG|Monster|tCCSG|3"
            }
         ]
      },
      {
         "name":"Vital Harvest",
         "source":"tCCSG",
         "className":"Cook",
         "classSource":"tCCSG",
         "subclassShortName":"Monster",
         "subclassSource":"tCCSG",
         "level":3,
         "entries":[
            "At 3rd level, you learn that there is a power left in creatures recently killed. During their last moments, the threat of death brings a creature to full and utmost life. The vital essence of a creature killed in this state lingers, but must be harvested and preserved to be utilized.",
            "If you or an ally kills a hostile creature with a challenge rating of 1 or higher, and the creature's body is not destroyed, you can harvest meat from the body for a special meal if it is of a type you know how to cook (described below). Harvesting this meat takes 1 hour, and you have 24 hours after killing the creature to harvest the meat before the vital essence fades.",
            "You keep this meat in your Cook's Bag until you are ready to prepare it. You can only have one of these meats in your Cook's Bag at a time. As part of a short or long rest, you can prepare the special meal from this meat. A number of creatures equal to 5 + your Constitution modifier can partake of the meal as part of the same short or long rest. These creatures gain a benefit depending on the creature type of the creature from which the meat came. This benefit lasts for 24 hours after the short or long rest ends, or until your next long rest, whichever comes first.",
            {
               "type":"list",
               "items":[
                  {
                     "type":"entries",
                     "name":"Beast",
                     "entries":[
                        "Your current and maximum hit points increase by 10."
                     ]
                  },
                  {
                     "type":"entries",
                     "name":"Monstrosity",
                     "entries":[
                        "You have advantage on Strength, Dexterity, and Constitution saving throws against magic."
                     ]
                  },
                  {
                     "type":"entries",
                     "name":"Ooze",
                     "entries":[
                        "You gain blindsight out to a range of 10 feet."
                     ]
                  },
                  {
                     "type":"entries",
                     "name":"Plant",
                     "entries":[
                        "While you are standing in direct sunlight, you have advantage on Strength and Constitution checks, and whenever you would regain hit points, treat any dice rolled as having rolled their maximum value."
                     ]
                  },
                  {
                     "type":"entries",
                     "name":"Aberration",
                     "entries":[
                        "You gain darkvision out to a range of 60 feet and telepathy out to a range of 60 feet."
                     ]
                  },
                  {
                     "type":"entries",
                     "name":"Dragon",
                     "entries":[
                        "You gain a flying speed of 60 feet. If you end your turn in the air, and nothing is keeping you aloft, you fall."
                     ]
                  },
                  {
                     "type":"entries",
                     "name":"Fiend",
                     "entries":[
                        "You have advantage on all Charisma and Intelligence checks and saving throws."
                     ]
                  },
                  {
                     "type":"entries",
                     "name":"Giant",
                     "entries":[
                        "You gain the benefits of the {@spell Enlarge} spell."
                     ]
                  }
               ]
            }
         ]
      },
      {
         "name":"Autonomous Bag",
         "source":"tCCSG",
         "className":"Cook",
         "classSource":"tCCSG",
         "subclassShortName":"Monster",
         "subclassSource":"tCCSG",
         "level":6,
         "entries":[
            "At 6th level, you modify your Cook's Bag to use the vitality coursing through a recently taken piece of flesh to cook it into a morsel.",
            "When you deal slashing or piercing damage to a hostile creature that isn't a humanoid, celestial, undead, construct, or fey, with a melee weapon attack, you can cut off a chunk of meat and place it into your Cook's Bag as part of the same attack. The chunk is immediately prepared into the Fresh Cut morsel (described below) by your Cook's Bag. You can't have more than one morsel of this type in your bag at a time.",
            "Your Cook's bag can season and cook the following morsel a number of times equal to your Constitution modifier (minimum of once). You regain expended uses when you finish a long rest.",
            "{@optfeature Fresh Cut|tCCSG}"
         ]
      },
      {
         "name":"Combat Bag",
         "source":"tCCSG",
         "className":"Cook",
         "classSource":"tCCSG",
         "subclassShortName":"Monster",
         "subclassSource":"tCCSG",
         "level":10,
         "entries":[
            "At 10th level, you modify your Cook's Bag into a weapon that spits your morsels out as projectiles. It counts as a simple, magical ranged weapon that only you are proficient with. It deals {@damage 1d12} bludgeoning damage, and has the ammunition (range 30/120) property.",
            "The only ammunition you can use for this weapon are your morsels. You choose which morsel you use as ammunition for each attack before you make an attack roll. When you hit a creature with this weapon, you can have the target immediately ingest the morsel used for ammunition."
         ]
      },
      {
         "name":"Vital Observance",
         "source":"tCCSG",
         "className":"Cook",
         "classSource":"tCCSG",
         "subclassShortName":"Monster",
         "subclassSource":"tCCSG",
         "level":14,
         "entries":[
            "At 14th level, your study of the vital essence of creatures allows you to see its ebb and flow, giving you insights into creatures you observe closely.",
            "If you observe a creature for 1 minute, you learn if it has any vulnerabilities, immunities, or resistances and what they are. You need only to be able to see the creature for the duration of the minute to gain this knowledge. You cannot observe more than one creature during this minute.",
            "You can gain knowledge using this feature a number of times equal to your Constitution modifier (minimum of once). You regain all expended uses when you finish a long rest."
         ]
      },
      {
         "name":"Legendary Morsel",
         "source":"tCCSG",
         "className":"Cook",
         "classSource":"tCCSG",
         "subclassShortName":"Monster",
         "subclassSource":"tCCSG",
         "level":18,
         "entries":[
            "At 18th level, you gain the ability to make the following morsel when you take a long rest. When you do so, you can make only one. It doesn't expire until your next long rest, and it doesn't count against the total number of morsels you can prepare.",
            "{@optfeature Vital Meat|tCCSG}"
         ]
      }
   ],
   "optionalfeature":[
      {
         "name":"Monkey’s Brains",
         "source":"tCCSG",
         "page":0,
         "featureType":[
            "Morsel"
         ],
         "prerequisite":[
            {
               "other":"Granted by Subclass"
            }
         ],
         "entries":[
            "The well-seasoned brains of the world’s most capable simians. For 10 minutes, if the target fails a saving throw, they can choose to succeed instead. If they choose to do so, this morsel's effect ends."
         ]
      },
      {
         "name":"Crytalline Heart",
         "source":"tCCSG",
         "page":0,
         "featureType":[
            "Morsel"
         ],
         "prerequisite":[
            {
               "other":"Granted by Subclass"
            }
         ],
         "entries":[
            "The heart of a rock candy giant. For 10 minutes, if the target’s total for a Strength, Dexterity, or Constitution ability check or saving throw is less than their score for the ability being checked, they can use that score in place of the total."
         ]
      },
      {
         "name":"Bubbly pill",
         "source":"tCCSG",
         "page":0,
         "featureType":[
            "Morsel"
         ],
         "prerequisite":[
            {
               "other":"Granted by Subclass"
            }
         ],
         "entries":[
            "This Carbon dioxide infused morsel dissolves in the target’s stomach, building up pressure inside their body. The target must make a Constitution saving throw. On a failed save they are poisoned and their speed is halved until the end of your next turn. Whether the save is successful or not, if the target is killed within 1 hour, it explodes. All creatures within 10 feet of the target must make a Dexterity saving throw. On a failed save they take 10d6 force damage if the target was Medium sized or smaller, and 5d6 extra force damage for each size category larger than Medium, or half as much damage on a successful save."
         ]
      },
      {
         "name":"Master Brew",
         "source":"tCCSG",
         "page":0,
         "featureType":[
            "Morsel"
         ],
         "prerequisite":[
            {
               "other":"Granted by Subclass"
            }
         ],
         "entries":[
            "A hard, fine liquor. When ingested, the target immediately becomes intoxicated for 10 minutes. When this intoxication ends, the target does not become hung over."
         ]
      },
      {
         "name":"Vital Meat",
         "source":"tCCSG",
         "page":0,
         "featureType":[
            "Morsel"
         ],
         "prerequisite":[
            {
               "other":"Granted by Subclass"
            }
         ],
         "entries":[
            "A bite of one of your harvests. When prepared, choose one of the benefits listed in your Vital Harvest feature. When this morsel is ingested, the target gains the chosen benefit for 1 minute."
         ]
      },
      {
         "name":"Fresh Cut",
         "source":"tCCSG",
         "page":0,
         "featureType":[
            "Morsel"
         ],
         "prerequisite":[
            {
               "other":"Made with Autonomous Bag"
            }
         ],
         "entries":[
            "A rare slice of flesh that heals allies and harms foes. When ingested by a friendly creature, the target regains 2d6 hit points. When ingested by a hostile creature, the target must make a Constitution saving throw. On a failed save they take 2d6 acid damage, or half as much damage on a success.",
            "The morsel's healing and damage increase by 1d6 when you reach certain levels in the cooks class: 7th level ({@dice 3d6}), 9th level ({@dice 4d6}), 13th level ({@dice 5d6}), 17th level ({@dice 6d6}), 20th level ({@dice 7d6})."
         ]
      },
      {
         "name":"Almond Milk",
         "source":"tCCSG",
         "page":0,
         "featureType":[
            "Morsel"
         ],
         "entries":[
            "Warm almond milk sprinkled with nutmeg. When ingested, it prepares the body for sleep. The target must make a Constitution saving throw. On a failed save, they will fall unconscious in 1 minute and remain unconscious for 10 minutes. They wake early if they take any damage or if a creature spends an action to shake or slap them awake.",
            "Creatures that do not need to sleep are unaffected by this morsel."
         ]
      },
      {
         "name":"Carrot Casserole",
         "source":"tCCSG",
         "page":0,
         "featureType":[
            "Morsel"
         ],
         "entries":[
            "Carrots cooked with a dozen herbs and spices. When ingested, it improves eyesight. The target gains darkvision out to a range of 60 feet for 8 hours. If the target already has darkvision, increase its range by 60 feet."
         ]
      },
      {
         "name":"Cow Innards",
         "source":"tCCSG",
         "page":0,
         "featureType":[
            "Morsel"
         ],
         "entries":[
            "A delectable treat that smells terrible. When ingested, it gives the body disgusting breath. The target must make a Constitution saving throw. If it fails, the target has disadvantage on all Charisma checks, and creatures cannot be charmed by the target for 10 minutes. If any creatures were charmed by the target when it ingested the morsel, the effect is suspended for the duration for any creatures that can smell the target."
         ]
      },
      {
         "name":"Flavored Ice",
         "source":"tCCSG",
         "page":0,
         "featureType":[
            "Morsel"
         ],
         "entries":[
            "Cream cold as ice. When ingested, it creates a brain freeze. The target must make an Intelligence saving throw. On a failed save, it takes {@damage 1d6} cold damage and has disadvantage on Concentration checks until the start of your next turn. On a successful save, the creature takes half damage and doesn't have disadvantage.",
            "The morsel's damage increases by 1d6 when you reach certain levels in this class: 4th level ({@dice 2d6}), 7th level ({@dice 3d6}), 9th level ({@dice 4d6}), 13th level ({@dice 5d6}), 17th level ({@dice 6d6}), and 20th level ({@dice 7d6})."
         ]
      },
      {
         "name":"Hardened Bread",
         "source":"tCCSG",
         "page":0,
         "featureType":[
            "Morsel"
         ],
         "entries":[
            "Bread baked to be harder than stone. When ingested, it breaks into chunks and clogs the throat. The target must make a Strength saving throw. On a failed save, it takes {@damage 1d6} bludgeoning damage and has disadvantage on attack rolls until the start of your next turn. On a successful save, the creature takes half as much damage and doesn't have disadvantage.",
            "The morsel's damage increases by 1d6 when you reach certain levels in this class: 4th level ({@dice 2d6}), 7th level ({@dice 3d6}), 9th level ({@dice 4d6}), 13th level ({@dice 5d6}), 17th level ({@dice 6d6}), and 20th level ({@dice 7d6})."
         ]
      },
      {
         "name":"Herbal Grey Tea",
         "source":"tCCSG",
         "page":0,
         "featureType":[
            "Morsel"
         ],
         "entries":[
            "A cup of steaming tea. When ingested, it clears the mind, and calms the body. The target adds 1d4 to all Constitution saving throws, Intelligence checks, and Wisdom checks for 1 hour."
         ]
      },
      {
         "name":"Invigorating Juices",
         "source":"tCCSG",
         "page":0,
         "featureType":[
            "Morsel"
         ],
         "entries":[
            "A delectable fruit sloshing with good juices. When ingested, the juices bolster the body’s constitution. The target gains 1d8 temporary hit points for 1 minute.",
            "The number of temporary hit points gained from this morsel increases by 1d8 when you reach certain levels in this class: 4th level (2d8), 7th level (3d8), 9th level (4d8), 13th level (5d8), 17th level (6d8), and 20th level (7d8)."
         ]
      },
      {
         "name":"Packed Protein",
         "source":"tCCSG",
         "page":0,
         "featureType":[
            "Morsel"
         ],
         "entries":[
            "A fried chicken leg. When ingested, it feeds the muscles at an enhanced rate. For 1 minute, the target adds 1d4 to all damage rolls and ability checks they make using Strength.",
            "The die rolled for this morsel increases when you reach certain levels in this class: 10th level (1d6), 15th level (1d8), 20th level (1d10)."
         ]
      },
      {
         "name":"Smoky Chops",
         "source":"tCCSG",
         "page":0,
         "featureType":[
            "Morsel"
         ],
         "entries":[
            "A smoky bite of pork. When ingested, it reacts with the stomach’s juices to create a fiery sensation that warms the body and manifests a fever. The target gains resistance to cold damage and immunity to the poisoned condition for 10 minutes."
         ]
      },
      {
         "name":"Spicy Pepper",
         "source":"tCCSG",
         "page":0,
         "featureType":[
            "Morsel"
         ],
         "entries":[
            "A spicy, roasted pepper. When ingested, it causes intense sweating that greases the body. The target gains resistance to fire damage and immunity to the grappled condition for 10 minutes."
         ]
      },
      {
         "name":"Sugar Crystals",
         "source":"tCCSG",
         "page":0,
         "featureType":[
            "Morsel"
         ],
         "entries":[
            "A string of crystallized sugars. When ingested, it overcharges the cells. The target’s speed increases by 5 feet for 10 minutes.",
            "This bonus increases when you reach certain levels in this class: 5th level (10 feet), 10th level (15 feet), 15th level (20 feet) and 20th level (25 feet)."
         ]
      },
      {
         "name":"Braised Rabbit",
         "source":"tCCSG",
         "page":0,
         "featureType":[
            "Morsel"
         ],
         "prerequisite":[
            {
               "level":{
                  "level":7,
                  "class":{
                     "name":"Cook"
                  }
               }
            }
         ],
         "entries":[
            "A rabbit haunch cooked with wine and herbs. When ingested, it instills the body with a springy dexterity. The target gains the effect of the Jump spell for 1 hour."
         ]
      },
      {
         "name":"Buttered Trout",
         "source":"tCCSG",
         "page":0,
         "featureType":[
            "Morsel"
         ],
         "prerequisite":[
            {
               "level":{
                  "level":7,
                  "class":{
                     "name":"Cook"
                  }
               }
            }
         ],
         "entries":[
            "Trout coated in butter. When ingested, it seizes the lungs and reworks the body's breathing apparatus. The target gains the effect of the Water Breathing spell for 1 hour. The target also gains a swim speed equal to their movement speed for the duration."
         ]
      },
      {
         "name":"Roast Pheasant",
         "source":"tCCSG",
         "page":0,
         "featureType":[
            "Morsel"
         ],
         "prerequisite":[
            {
               "level":{
                  "level":7,
                  "class":{
                     "name":"Cook"
                  }
               }
            }
         ],
         "entries":[
            "Roasted pheasant wing. When ingested, it creates a lightness in the body. For 10 minutes, when the target falls, their rate of descent slows to a rate between 5 feet per round and 60 feet per round (their choice). They can choose their rate of descent again at the start of each of their turns. If they land before the morsel's effect ends, they take no falling damage."
         ]
      },
      {
         "name":"Spider Eggs",
         "source":"tCCSG",
         "page":0,
         "featureType":[
            "Morsel"
         ],
         "prerequisite":[
            {
               "level":{
                  "level":7,
                  "class":{
                     "name":"Cook"
                  }
               }
            }
         ],
         "entries":[
            "Salt-cured spider eggs. When ingested, it improves the body's grip. The target gains the effect of the Spider Climb spell for 1 hour."
         ]
      },
      {
         "name":"Thickening Gruel",
         "source":"tCCSG",
         "page":0,
         "featureType":[
            "Morsel"
         ],
         "prerequisite":[
            {
               "level":{
                  "level":7,
                  "class":{
                     "name":"Cook"
                  }
               }
            }
         ],
         "entries":[
            "A hardy porridge . When ingested, it thickens the skin. The target gains the effect of the Barkskin spell for 10 minutes."
         ]
      },
      {
         "name":"Chamomile Tea",
         "source":"tCCSG",
         "page":0,
         "featureType":[
            "Morsel"
         ],
         "prerequisite":[
            {
               "level":{
                  "level":11,
                  "class":{
                     "name":"Cook"
                  }
               }
            }
         ],
         "entries":[
            "Tea steeped with Chamomile leaves. When ingested, the tea relaxes the muscles, weakening physical strikes. For 1 minute, whenever the target makes a weapon attack, they must subtract 1d6 from their damage roll for that attack."
         ]
      },
      {
         "name":"Shreevy Leaves",
         "source":"tCCSG",
         "page":0,
         "featureType":[
            "Morsel"
         ],
         "prerequisite":[
            {
               "level":{
                  "level":11,
                  "class":{
                     "name":"Cook"
                  }
               }
            }
         ],
         "entries":[
            "Leaves of the Shreeve shrub, baked to release calming chemicals. When ingested, the target must make a Wisdom saving throw. On a failed save, the creature becomes indifferent to all other creatures for 1 minute. The indifference ends early if the target is damaged in any way. A creature who can't be charmed is immune to this effect."
         ]
      },
      {
         "name":"Spectral Sprouts",
         "source":"tCCSG",
         "page":0,
         "featureType":[
            "Morsel"
         ],
         "prerequisite":[
            {
               "level":{
                  "level":11,
                  "class":{
                     "name":"Cook"
                  }
               }
            }
         ],
         "entries":[
            "Bean sprouts grown on haunted ground. When ingested, the target gains the benefits of the See Invisibility spell for 1 minute. The target can also use an action to enter or exit the ethereal plane for the duration."
         ]
      },
      {
         "name":"Startouched Seeds",
         "source":"tCCSG",
         "page":0,
         "featureType":[
            "Morsel"
         ],
         "prerequisite":[
            {
               "level":{
                  "level":11,
                  "class":{
                     "name":"Cook"
                  }
               }
            }
         ],
         "entries":[
            "Sunflower seeds baked in starlight. When ingested the target rolls 1d4. The creature can recover expended spell slots that have a combined level that is equal to or less than the number rolled. If the recovered spell slots are not used in the next minute, they are lost."
         ]
      },
      {
         "name":"Sweet and Sour Beets",
         "source":"tCCSG",
         "page":0,
         "featureType":[
            "Morsel"
         ],
         "prerequisite":[
            {
               "level":{
                  "level":11,
                  "class":{
                     "name":"Cook"
                  }
               }
            }
         ],
         "entries":[
            "Sugared beets dipped in soured creams. When ingested, it softens the skin, weakening the body against physical attacks. For 1 minute, add 1d6 extra damage to the first weapon attack that hits the target on each turn."
         ]
      },
      {
         "name":"Boiled Dragon's Tail",
         "source":"tCCSG",
         "page":0,
         "featureType":[
            "Morsel"
         ],
         "prerequisite":[
            {
               "level":{
                  "level":15,
                  "class":{
                     "name":"Cook"
                  }
               }
            }
         ],
         "entries":[
            "A tough chunk of tail, boiled until soft and white. When ingested, the target grows scales across their body, and they sprout a tail made of fire. For 1 minute, the target gains a +1 bonus to AC, and they can use an action to do one of the following:",
            {
               "type":"entries",
               "name":"Frightful Presence.",
               "entries":[
                  "The target roars. Each creature of the target's choice that is within 30 feet of the target must succeed on a Wisdom saving throw or become Frightened of the target for 1 minute. The DC for the saving throw is equal to your Morsel save DC. A creature can repeat its saving throw at the end of each of its turns, ending the effect on itself on a success. If a creature's saving throw is successful, the creature is immune to the target's Frightful Presence for the next minute."
               ]
            },
            {
               "type":"entries",
               "name":"Tail Swipe.",
               "entries":[
                  "Melee Weapon Attack: +8 to hit, reach 10 ft., one target. Hit: 4d8 fire damage."
               ]
            }
         ]
      },
      {
         "name":"Hydra Tongue",
         "source":"tCCSG",
         "page":0,
         "featureType":[
            "Morsel"
         ],
         "prerequisite":[
            {
               "level":{
                  "level":15,
                  "class":{
                     "name":"Cook"
                  }
               }
            }
         ],
         "entries":[
            "Tongue from one of a Hydra's mouths, simmered in strong aromatics. When ingested, the target grows a second head that lasts for 1 minute. The head grants them the following benefits:",
            {
               "type":"list",
               "items":[
                  "They gain 1d10 temporary hit points at the start of their turn.",
                  "Any limbs amputated within the last 24 hours regenerate at the start of each of their turns.",
                  "They gain an extra reaction that can only be used for opportunity attacks.",
                  "They gain an extra action that can only be used to take the Disengage, Help, or Search action."
               ]
            },
            "At the end of the duration, the head falls off and evaporates, leaving behind no trace."
         ]
      },
      {
         "name":"Elemental Pie",
         "source":"tCCSG",
         "page":0,
         "featureType":[
            "Morsel"
         ],
         "prerequisite":[
            {
               "level":{
                  "level":15,
                  "class":{
                     "name":"Cook"
                  }
               }
            }
         ],
         "entries":[
            "A pastry with a fruity filling swirled together with the primal elemental salts. When ingested, the power of the elements manifests itself inside the target's body. For 1 minute, the target gains resistance to Acid, Fire, Poison, Lightning, and Thunder damage. They also gain a flying and swimming speed equal to their walking speed for the duration."
         ]
      },
      {
         "name":"Frosted Grapes",
         "source":"tCCSG",
         "page":0,
         "featureType":[
            "Morsel"
         ],
         "prerequisite":[
            {
               "level":{
				   "level":1,
                  "class":{
                     "name":"Cook"
                  },
                  "subclass":{
                     "name":"Sous",
                     "visible":true
                  }
               }
            }
         ],
         "entries":[
            "Grapes dusted with white sugar. When ingested, it powers the nerves at an enhanced rate. For 1 minute, the target adds 1d4 to all damage rolls and ability checks they make using Dexterity.",
            "The die rolled for this morsel increases when you reach certain levels in this class: 10th level (1d6), 15th level (1d8), 20th level (1d10)."
         ]
      },
      {
         "name":"Strong Ale",
         "source":"tCCSG",
         "page":0,
         "featureType":[
            "Morsel"
         ],
         "prerequisite":[
            {
               "level":{
                  "level":7,
                  "class":{
                     "name":"Cook"
                  },
                  "subclass":{
                     "name":"Sous",
                     "visible":true
                  }
               }
            }
         ],
         "entries":[
            "Intensely fermented alcohol. When ingested, it loosens the body’s muscles. The target gains resistance to nonmagical bludgeoning, piercing, and slashing damage from weapon attacks for 1 minute."
         ]
      },
      {
         "name":"Honeyed Fish",
         "source":"tCCSG",
         "page":0,
         "featureType":[
            "Morsel"
         ],
         "prerequisite":[
            {
               "level":{
                  "level":13,
                  "class":{
                     "name":"Cook"
                  },
                  "subclass":{
                     "name":"Sous",
                     "visible":true
                  }
               }
            }
         ],
         "entries":[
            "A sweet and juicy fish. When ingested, it boosts the powers of the mind. The target has advantage on all Intelligence, Wisdom, and Charisma checks for 1 minute."
         ]
      },
      {
         "name":"Pine Nut Mash",
         "source":"tCCSG",
         "page":0,
         "featureType":[
            "Morsel"
         ],
         "prerequisite":[
            {
               "level":{
                  "level":17,
                  "class":{
                     "name":"Cook"
                  },
                  "subclass":{
                     "name":"Sous",
                     "visible":true
                  }
               }
            }
         ],
         "entries":[
            "Roasted pine nuts smashed into a chunky cream. When ingested, it gives the target a sweet, fragrant breath. All friendly creatures within 10 feet of the target (including the target) have advantage on saving throws for 1 minute."
         ]
      },
      {
         "name":"Stinking Sprouts",
         "source":"tCCSG",
         "page":0,
         "featureType":[
            "Morsel"
         ],
         "prerequisite":[
            {
               "level":{
                  "level":1,
                  "class":{
                     "name":"Cook"
                  },
                  "subclass":{
                     "name":"Mess",
                     "visible":true
                  }
               }
            }
         ],
         "entries":[
            "Brussel sprouts wrapped in ham. When ingested, they power consistent and disruptive flatulence. The target gains immunity to the charmed and frightened conditions for 1 minute."
         ]
      },
      {
         "name":"Bloating Beans",
         "source":"tCCSG",
         "page":0,
         "featureType":[
            "Morsel"
         ],
         "prerequisite":[
            {
               "level":{
                  "level":7,
                  "class":{
                     "name":"Cook"
                  },
                  "subclass":{
                     "name":"Mess",
                     "visible":true
                  }
               }
            }
         ],
         "entries":[
            "Hearty, yet swelling food. When ingested by a Medium or smaller creature, the target grows into a much pudgier, threatening form. The target’s size doubles, and its weight is multiplied by eight for 1 minute. This growth increases its size by one category. The target also gains advantage on Strength checks and Strength saving throws for the duration."
         ]
      },
      {
         "name":"Jittering Coffee",
         "source":"tCCSG",
         "page":0,
         "featureType":[
            "Morsel"
         ],
         "prerequisite":[
            {
               "level":{
                  "level":13,
                  "class":{
                     "name":"Cook"
                  },
                  "subclass":{
                     "name":"Mess",
                     "visible":true
                  }
               }
            }
         ],
         "entries":[
            "Coffee with an unnaturally high amount of caffeine. When ingested, it supercharges the nerves, constantly sending electrical currents through the heart. For 1 minute, if the target drops to 0 hit points as a result of taking damage, the target instead drops to 1 hit point, and this morsel's effect ends."
         ]
      },
      {
         "name":"Fatty Oats",
         "source":"tCCSG",
         "page":0,
         "featureType":[
            "Morsel"
         ],
         "prerequisite":[
            {
               "level":{
                  "level":17,
                  "class":{
                     "name":"Cook"
                  },
                  "subclass":{
                     "name":"Mess",
                     "visible":true
                  }
               }
            }
         ],
         "entries":[
            "Complex grains suffused with healthy fats. When ingested, it builds up the hardiness of the skin to prevent harm. The target has resistance to all damage until the end of your next turn."
         ]
      },
      {
         "name":"Greasy Slosh",
         "source":"tCCSG",
         "page":0,
         "featureType":[
            "Morsel"
         ],
         "prerequisite":[
            {
               "level":{
				   "level":1,
                  "class":{
                     "name":"Cook"
                  },
                  "subclass":{
                     "name":"Hash",
                     "visible":true
                  }
               }
            }
         ],
         "entries":[
            "A thick, heavy, and acidic porridge. When ingested, it forces the body to use a significant amount of energy to process. The target must make a Constitution saving throw. On a failed save, it takes 1d6 acid damage and is considered restrained for 1 minute. At the end of each of its turns, the target can make another Constitution saving throw. On a success, the effect ends on the target. On a successful save, the target takes half damage and is not restrained.",
            "The morsel's damage increases by 1d6 when you reach certain levels in this class: 4th level (2d6), 7th level (3d6), 9th level (4d6), 13th level (5d6), 17th level (6d6), and 20th level (7d6)."
         ]
      },
      {
         "name":"Fire Salts",
         "source":"tCCSG",
         "page":0,
         "featureType":[
            "Morsel"
         ],
         "prerequisite":[
            {
               "level":{
                  "level":7,
                  "class":{
                     "name":"Cook"
                  },
                  "subclass":{
                     "name":"Hash",
                     "visible":true
                  }
               }
            }
         ],
         "entries":[
            "A rare and combustible spice. When ingested, it mixes with the target creature’s breath and spit to create a fiery discharge. All creatures within 15 feet of the target (including the target) must make a Dexterity saving throw. On a failed save they take 4d6 fire damage, or half as much on a successful save.",
            "The morsel's damage increases by 1d6 when you reach certain levels in this class: 9th level (5d6), 13th level (6d6), 17th level (7d6), 20th level (8d6)."
         ]
      },
      {
         "name":"Garlic Tuna",
         "source":"tCCSG",
         "page":0,
         "featureType":[
            "Morsel"
         ],
         "prerequisite":[
            {
               "level":{
                  "level":13,
                  "class":{
                     "name":"Cook"
                  },
                  "subclass":{
                     "name":"Hash",
                     "visible":true
                  }
               }
            }
         ],
         "entries":[
            "Festering tuna baked in over-ripened garlic. When ingested, it causes the target to exude rot from every pore. The target must make a Constitution saving throw. On a failed save, all hostile creatures within 10 feet of the target (including the target) have disadvantage on saving throws for 1 minute."
         ]
      },
      {
         "name":"Rancid Onion",
         "source":"tCCSG",
         "page":0,
         "featureType":[
            "Morsel"
         ],
         "prerequisite":[
            {
               "level":{
                  "level":17,
                  "class":{
                     "name":"Cook"
                  },
                  "subclass":{
                     "name":"Hash",
                     "visible":true
                  }
               }
            }
         ],
         "entries":[
            "A vegetable in the heat of decomposition. When ingested, the target sprays the vegetable’s over-ripened juices all around itself. All hostile creatures within 30 feet of the target (including the target) must make a Constitution saving throw. On a failed save they are paralyzed until the start of your next turn and blinded for 1 minute. At the end of each of its turns, a target can make another Constitution saving throw. On a success, they are no longer blinded."
         ]
      },
      {
         "name":"Underdark Draught",
         "source":"tCCSG",
         "page":0,
         "featureType":[
            "Morsel"
         ],
         "prerequisite":[
            {
               "level":{
                  "level":1,
                  "class":{
                     "name":"Cook"
                  },
                  "subclass":{
                     "name":"Brew",
                     "visible":true
                  }
               }
            }
         ],
         "entries":[
            "A pitch black ale, foaming with shadows. When ingested, the target immediately vomits magical darkness that fills a 10- foot radius sphere centered on the target. A creature with darkvision can't see through this darkness and nonmagical light can't illuminate it.",
            "The darkness lasts for 1 minute. All creatures friendly to the target (including the target) can see through this magical darkness."
         ]
      },
      {
         "name":"Vodka Slushie",
         "source":"tCCSG",
         "page":0,
         "featureType":[
            "Morsel"
         ],
         "prerequisite":[
            {
               "level":{
                  "level":7,
                  "class":{
                     "name":"Cook"
                  },
                  "subclass":{
                     "name":"Brew",
                     "visible":true
                  }
               }
            }
         ],
         "entries":[
            "A white swirl of frozen vodka, misting a boozy aroma. When ingested, the target immediately vomits snow that covers the ground around them. The ground in a 15-foot radius centered on the target becomes covered with snow.",
            "The snow is considered difficult terrain for all creatures hostile to the target. When the snow is vomited, all creatures hostile to the target within in the area must make a Strength saving throw. On a failed save, a creature is pushed out of the snow's area, away from the target. The snow lasts for 1 minute, or until melted by an intense heat."
         ]
      },
      {
         "name":"Hellfire Whiskey",
         "source":"tCCSG",
         "page":0,
         "featureType":[
            "Morsel"
         ],
         "prerequisite":[
            {
               "level":{
                  "level":13,
                  "class":{
                     "name":"Cook"
                  },
                  "subclass":{
                     "name":"Brew",
                     "visible":true
                  }
               }
            }
         ],
         "entries":[
            "A grey liquor, with sickly, yellow flames caressing the surface. When ingested, the target's eyes and body become wreathed in yellow-green flames for 1 minute. The flames shed dim light in a 10-foot radius, reaching out to drain the life of the target's enemies. When a large or smaller creature that is hostile to the target moves into the dim light for the first time on a turn, or starts its turn there, they must make a Constitution saving throw. On a failed save, they suffer one level of exhaustion."
         ]
      },
      {
         "name":"Angel's Kiss",
         "source":"tCCSG",
         "page":0,
         "featureType":[
            "Morsel"
         ],
         "prerequisite":[
            {
               "level":{
                  "level":17,
                  "class":{
                     "name":"Cook"
                  },
                  "subclass":{
                     "name":"Brew",
                     "visible":true
                  }
               }
            }
         ],
         "entries":[
            "White wine, bubbling with divine energy. When ingested, the target sheds bright light in a 30 foot radius, and dim light for an additional 30 feet for 1 minute. When a creature hostile to the target starts their turn in the bright light, they must make a Constitution saving throw. On a failed save, they are blinded until the start of their next turn. Creatures with darkvision make this save with disadvantage."
         ]
      }
   ],
   "subclass":[
      {
         "name":"Sous Chef",
         "source":"tCCSG",
         "shortname":"Sous",
         "subclassFeatures":[
            "Sous Chef|Cook|tCCSG|Sous|tCCSG|3",
            "Secret Sauce|Cook|tCCSG|Sous|tCCSG|6",
            "Aromatic Scent|Cook|tCCSG|Sous|tCCSG|10",
            "Magnificent Meal|Cook|tCCSG|Sous|tCCSG|14",
            "Legendary Morsel|Cook|tCCSG|Sous|tCCSG|18"
         ],
         "className":"Cook",
         "classSource":"tCCSG"
      },
      {
         "name":"Mess Sergeant",
         "source":"tCCSG",
         "shortname":"Mess",
         "subclassFeatures":[
            "Mess Sergeant|Cook|tCCSG|Mess|tCCSG|3",
            "Raucous Belch|Cook|tCCSG|Mess|tCCSG|6",
            "Sturdy Stomach|Cook|tCCSG|Mess|tCCSG|10",
            "Strict Diet|Cook|tCCSG|Mess|tCCSG|14",
            "Legendary Morsel|Cook|tCCSG|Mess|tCCSG|18"
         ],
         "className":"Cook",
         "classSource":"tCCSG"
      },
      {
         "name":"Hash Slinger",
         "source":"tCCSG",
         "shortname":"Hash",
         "subclassFeatures":[
            "Hash Slinger|Cook|tCCSG|Hash|tCCSG|3",
            "Extra Attack|Cook|tCCSG|Hash|tCCSG|6",
            "Horrific Stench|Cook|tCCSG|Hash|tCCSG|10",
            "Noxious Strike|Cook|tCCSG|Hash|tCCSG|14",
            "Legendary Morsel|Cook|tCCSG|Hash|tCCSG|18"
         ],
         "className":"Cook",
         "classSource":"tCCSG"
      },
      {
         "name":"Brewmeister",
         "source":"tCCSG",
         "shortname":"Brew",
         "subclassFeatures":[
            "Brewmeister|Cook|tCCSG|Brew|tCCSG|3",
            "Drunken Stumble|Cook|tCCSG|Brew|tCCSG|6",
            "Boozy Yield|Cook|tCCSG|Brew|tCCSG|10",
            "Angry Drunk|Cook|tCCSG|Brew|tCCSG|14",
            "Legendary Morsel|Cook|tCCSG|Brew|tCCSG|18"
         ],
         "className":"Cook",
         "classSource":"tCCSG"
      },
      {
         "name":"Monster Masher",
         "source":"tCCSG",
         "shortname":"Monster",
         "subclassFeatures":[
            "Monster Masher|Cook|tCCSG|Monster|tCCSG|3",
            "Autonomous Bag|Cook|tCCSG|Monster|tCCSG|6",
            "Combat Bag|Cook|tCCSG|Monster|tCCSG|10",
            "Vital Observance|Cook|tCCSG|Monster|tCCSG|14",
            "Legendary Morsel|Cook|tCCSG|Monster|tCCSG|18"
         ],
         "className":"Cook",
         "classSource":"tCCSG"
      }
   ]
}